[Survived] ObjectLiteral
src/appearance-state.tsx:28:58
   refreshAfterImport: () => Promise<AppearanceSnapshot>;
   save: (input: AppearanceInput) => Promise<AppearanceSnapshot>;
 };
-const AppearanceContext = createContext<AppearanceState>({
-  failed: false,
-  reading: true,
-  uncertain: false,
-  reload: async () => {
-    throw new Error("Apariencia no disponible");
-  },
-  refreshAfterImport: async () => {
-    throw new Error("Apariencia no disponible");
-  },
-  save: async () => {
-    throw new Error("Consulta la apariencia antes de guardar");
-  },
-});
+const AppearanceContext = createContext<AppearanceState>({});
 export const useAppearance = () => useContext(AppearanceContext);
 // La barra del navegador sigue al lienzo real, aunque la preferencia contradiga al OS.

[Survived] BooleanLiteral
src/appearance-state.tsx:29:11
   save: (input: AppearanceInput) => Promise<AppearanceSnapshot>;
 };
 const AppearanceContext = createContext<AppearanceState>({
-  failed: false,
+  failed: true,
   reading: true,
   uncertain: false,

[Survived] BooleanLiteral
src/appearance-state.tsx:30:12
 };
 const AppearanceContext = createContext<AppearanceState>({
   failed: false,
-  reading: true,
+  reading: false,
   uncertain: false,
   reload: async () => {

[Survived] BooleanLiteral
src/appearance-state.tsx:31:14
 const AppearanceContext = createContext<AppearanceState>({
   failed: false,
   reading: true,
-  uncertain: false,
+  uncertain: true,
   reload: async () => {
     throw new Error("Apariencia no disponible");

[NoCoverage] BlockStatement
src/appearance-state.tsx:32:23
   failed: false,
   reading: true,
   uncertain: false,
-  reload: async () => {
-    throw new Error("Apariencia no disponible");
-  },
+  reload: async () => {},
   refreshAfterImport: async () => {
     throw new Error("Apariencia no disponible");

[NoCoverage] BlockStatement
src/appearance-state.tsx:35:35
   reload: async () => {
     throw new Error("Apariencia no disponible");
   },
-  refreshAfterImport: async () => {
-    throw new Error("Apariencia no disponible");
-  },
+  refreshAfterImport: async () => {},
   save: async () => {
     throw new Error("Consulta la apariencia antes de guardar");

[NoCoverage] StringLiteral
src/appearance-state.tsx:36:21
     throw new Error("Apariencia no disponible");
   },
   refreshAfterImport: async () => {
-    throw new Error("Apariencia no disponible");
+    throw new Error("");
   },
   save: async () => {

[NoCoverage] BlockStatement
src/appearance-state.tsx:38:21
   refreshAfterImport: async () => {
     throw new Error("Apariencia no disponible");
   },
-  save: async () => {
-    throw new Error("Consulta la apariencia antes de guardar");
-  },
+  save: async () => {},
 });
 export const useAppearance = () => useContext(AppearanceContext);

[NoCoverage] StringLiteral
src/appearance-state.tsx:39:21
     throw new Error("Apariencia no disponible");
   },
   save: async () => {
-    throw new Error("Consulta la apariencia antes de guardar");
+    throw new Error("");
   },
 });

[Killed] ArrowFunction
src/appearance-state.tsx:42:30
     throw new Error("Consulta la apariencia antes de guardar");
   },
 });
-export const useAppearance = () => useContext(AppearanceContext);
+export const useAppearance = () => undefined;
 // La barra del navegador sigue al lienzo real, aunque la preferencia contradiga al OS.
 function paintThemeColor() {
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Cannot destructure property 'snapshot' of 'useAppearance(...)' as it is undefined.

[Killed] BlockStatement
src/appearance-state.tsx:44:28
 });
 export const useAppearance = () => useContext(AppearanceContext);
 // La barra del navegador sigue al lienzo real, aunque la preferencia contradiga al OS.
-function paintThemeColor() {
-  const canvas = getComputedStyle(document.documentElement)
-    .getPropertyValue("--canvas")
-    .trim();
-  if (!canvas) return;
-  for (const meta of document.querySelectorAll<HTMLMetaElement>(
-    'meta[name="theme-color"]',
-  ))
-    meta.content = canvas;
-}
+function paintThemeColor() {}
 export function AppearanceProvider({ children }: { children: ReactNode }) {
   const [snapshot, setSnapshot] = useState<AppearanceSnapshot>();
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: expected '#000000' to be '#111827' // Object.is equality

[Survived] MethodExpression
src/appearance-state.tsx:45:18
 export const useAppearance = () => useContext(AppearanceContext);
 // La barra del navegador sigue al lienzo real, aunque la preferencia contradiga al OS.
 function paintThemeColor() {
-  const canvas = getComputedStyle(document.documentElement)
-    .getPropertyValue("--canvas")
-    .trim();
+  const canvas = getComputedStyle(document.documentElement).getPropertyValue("--canvas");
   if (!canvas) return;
   for (const meta of document.querySelectorAll<HTMLMetaElement>(

[Killed] StringLiteral
src/appearance-state.tsx:46:23
 // La barra del navegador sigue al lienzo real, aunque la preferencia contradiga al OS.
 function paintThemeColor() {
   const canvas = getComputedStyle(document.documentElement)
-    .getPropertyValue("--canvas")
+    .getPropertyValue("")
     .trim();
   if (!canvas) return;
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: expected '#000000' to be '#111827' // Object.is equality

[Killed] ConditionalExpression
src/appearance-state.tsx:48:7
   const canvas = getComputedStyle(document.documentElement)
     .getPropertyValue("--canvas")
     .trim();
-  if (!canvas) return;
+  if (true) return;
   for (const meta of document.querySelectorAll<HTMLMetaElement>(
     'meta[name="theme-color"]',
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: expected '#000000' to be '#111827' // Object.is equality

[Killed] BooleanLiteral
src/appearance-state.tsx:48:7
   const canvas = getComputedStyle(document.documentElement)
     .getPropertyValue("--canvas")
     .trim();
-  if (!canvas) return;
+  if (canvas) return;
   for (const meta of document.querySelectorAll<HTMLMetaElement>(
     'meta[name="theme-color"]',
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: expected '#000000' to be '#111827' // Object.is equality

[Killed] StringLiteral
src/appearance-state.tsx:50:5
     .trim();
   if (!canvas) return;
   for (const meta of document.querySelectorAll<HTMLMetaElement>(
-    'meta[name="theme-color"]',
+    "",
   ))
     meta.content = canvas;
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: expected '#000000' to be '#111827' // Object.is equality

[Killed] BooleanLiteral
src/appearance-state.tsx:56:40
 }
 export function AppearanceProvider({ children }: { children: ReactNode }) {
   const [snapshot, setSnapshot] = useState<AppearanceSnapshot>();
-  const [failed, setFailed] = useState(false);
+  const [failed, setFailed] = useState(true);
   const [reading, setReading] = useState(true);
   const [uncertain, setUncertain] = useState(false);
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p>, …(3) ] to have a length of 3 but got 4

[Killed] BooleanLiteral
src/appearance-state.tsx:57:42
 export function AppearanceProvider({ children }: { children: ReactNode }) {
   const [snapshot, setSnapshot] = useState<AppearanceSnapshot>();
   const [failed, setFailed] = useState(false);
-  const [reading, setReading] = useState(true);
+  const [reading, setReading] = useState(false);
   const [uncertain, setUncertain] = useState(false);
   const readRequest = useRef<AbortController | null>(null);
killedBy: @s34 @s35 distinguishes initial authenticated=false from anonymous login on an unknown local route
statusReason: expected [] to have a length of 1 but got +0

[Survived] BooleanLiteral
src/appearance-state.tsx:58:46
   const [snapshot, setSnapshot] = useState<AppearanceSnapshot>();
   const [failed, setFailed] = useState(false);
   const [reading, setReading] = useState(true);
-  const [uncertain, setUncertain] = useState(false);
+  const [uncertain, setUncertain] = useState(true);
   const readRequest = useRef<AbortController | null>(null);
   const writeRequest = useRef<AbortController | null>(null);

[Killed] BlockStatement
src/appearance-state.tsx:61:28
   const [uncertain, setUncertain] = useState(false);
   const readRequest = useRef<AbortController | null>(null);
   const writeRequest = useRef<AbortController | null>(null);
-  const retireRead = () => {
-    readRequest.current?.abort();
-    readRequest.current = null;
-    setReading(false);
-  };
+  const retireRead = () => {};
   const retryInitiator = useRef<HTMLElement | null>(null);
   useLayoutEffect(() => {
killedBy: @s30 invalidates a read started during a write when that write confirms
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  DARK
Received:
  LIGHT

[Killed] OptionalChaining
src/appearance-state.tsx:62:5
   const readRequest = useRef<AbortController | null>(null);
   const writeRequest = useRef<AbortController | null>(null);
   const retireRead = () => {
-    readRequest.current?.abort();
+    readRequest.current.abort();
     readRequest.current = null;
     setReading(false);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BooleanLiteral
src/appearance-state.tsx:64:16
   const retireRead = () => {
     readRequest.current?.abort();
     readRequest.current = null;
-    setReading(false);
+    setReading(true);
   };
   const retryInitiator = useRef<HTMLElement | null>(null);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Killed] BlockStatement
src/appearance-state.tsx:67:25
     setReading(false);
   };
   const retryInitiator = useRef<HTMLElement | null>(null);
-  useLayoutEffect(() => {
-    const control = retryInitiator.current;
-    if (control && !control.isConnected) {
-      retryInitiator.current = null;
-      if (document.activeElement === document.body) {
-        const heading = document.querySelector<HTMLElement>("main h1");
-        if (heading) {
-          heading.tabIndex = -1;
-          heading.focus();
-        }
-      }
-    }
-  });
+  useLayoutEffect(() => {});
   const save = async (input: AppearanceInput) => {
     if (!snapshot || writeRequest.current || uncertain)
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Killed] CallExpression
src/appearance-state.tsx:67:3
     setReading(false);
   };
   const retryInitiator = useRef<HTMLElement | null>(null);
-  useLayoutEffect(() => {
-    const control = retryInitiator.current;
-    if (control && !control.isConnected) {
-      retryInitiator.current = null;
-      if (document.activeElement === document.body) {
-        const heading = document.querySelector<HTMLElement>("main h1");
-        if (heading) {
-          heading.tabIndex = -1;
-          heading.focus();
-        }
-      }
-    }
-  });
+  ;
   const save = async (input: AppearanceInput) => {
     if (!snapshot || writeRequest.current || uncertain)
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Killed] LogicalOperator
src/appearance-state.tsx:69:9
   const retryInitiator = useRef<HTMLElement | null>(null);
   useLayoutEffect(() => {
     const control = retryInitiator.current;
-    if (control && !control.isConnected) {
+    if (control || !control.isConnected) {
       retryInitiator.current = null;
       if (document.activeElement === document.body) {
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: Cannot read properties of null (reading 'isConnected')

[Killed] BlockStatement
src/appearance-state.tsx:69:42
   const retryInitiator = useRef<HTMLElement | null>(null);
   useLayoutEffect(() => {
     const control = retryInitiator.current;
-    if (control && !control.isConnected) {
-      retryInitiator.current = null;
-      if (document.activeElement === document.body) {
-        const heading = document.querySelector<HTMLElement>("main h1");
-        if (heading) {
-          heading.tabIndex = -1;
-          heading.focus();
-        }
-      }
-    }
+    if (control && !control.isConnected) {}
   });
   const save = async (input: AppearanceInput) => {
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Killed] BlockStatement
src/appearance-state.tsx:71:53
     const control = retryInitiator.current;
     if (control && !control.isConnected) {
       retryInitiator.current = null;
-      if (document.activeElement === document.body) {
-        const heading = document.querySelector<HTMLElement>("main h1");
-        if (heading) {
-          heading.tabIndex = -1;
-          heading.focus();
-        }
-      }
+      if (document.activeElement === document.body) {}
     }
   });
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Killed] EqualityOperator
src/appearance-state.tsx:71:11
     const control = retryInitiator.current;
     if (control && !control.isConnected) {
       retryInitiator.current = null;
-      if (document.activeElement === document.body) {
+      if (document.activeElement !== document.body) {
         const heading = document.querySelector<HTMLElement>("main h1");
         if (heading) {
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Killed] StringLiteral
src/appearance-state.tsx:72:61
     if (control && !control.isConnected) {
       retryInitiator.current = null;
       if (document.activeElement === document.body) {
-        const heading = document.querySelector<HTMLElement>("main h1");
+        const heading = document.querySelector<HTMLElement>("");
         if (heading) {
           heading.tabIndex = -1;
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: Invalid selector

[Killed] ConditionalExpression
src/appearance-state.tsx:73:13
       retryInitiator.current = null;
       if (document.activeElement === document.body) {
         const heading = document.querySelector<HTMLElement>("main h1");
-        if (heading) {
+        if (false) {
           heading.tabIndex = -1;
           heading.focus();
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Killed] BlockStatement
src/appearance-state.tsx:73:22
       retryInitiator.current = null;
       if (document.activeElement === document.body) {
         const heading = document.querySelector<HTMLElement>("main h1");
-        if (heading) {
-          heading.tabIndex = -1;
-          heading.focus();
-        }
+        if (heading) {}
       }
     }
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1>
  Dale espacio a tu
  <br
    class="desktop-break"
  />

[Survived] UnaryOperator
src/appearance-state.tsx:74:30
       if (document.activeElement === document.body) {
         const heading = document.querySelector<HTMLElement>("main h1");
         if (heading) {
-          heading.tabIndex = -1;
+          heading.tabIndex = +1;
           heading.focus();
         }

[Killed] CallExpression
src/appearance-state.tsx:75:11
         const heading = document.querySelector<HTMLElement>("main h1");
         if (heading) {
           heading.tabIndex = -1;
-          heading.focus();
+          ;
         }
       }
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Dale espacio a tu
  <br

[Killed] BooleanLiteral
src/appearance-state.tsx:81:9
     }
   });
   const save = async (input: AppearanceInput) => {
-    if (!snapshot || writeRequest.current || uncertain)
+    if (snapshot || writeRequest.current || uncertain)
       throw new Error("Consulta la apariencia antes de guardar");
     retireRead();
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance-state.tsx:81:9
     }
   });
   const save = async (input: AppearanceInput) => {
-    if (!snapshot || writeRequest.current || uncertain)
+    if (true)
       throw new Error("Consulta la apariencia antes de guardar");
     retireRead();
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] CallExpression
src/appearance-state.tsx:83:5
   const save = async (input: AppearanceInput) => {
     if (!snapshot || writeRequest.current || uncertain)
       throw new Error("Consulta la apariencia antes de guardar");
-    retireRead();
+    ;
     const controller = new AbortController();
     writeRequest.current = controller;
killedBy: @s30 does not let a preceding shared read replace a confirmed save: 401
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      401,

[Killed] BlockStatement
src/appearance-state.tsx:86:9
     retireRead();
     const controller = new AbortController();
     writeRequest.current = controller;
-    try {
-      const next = await saveAppearance(
-        input,
-        snapshot.etag,
-        controller.signal,
-      );
-      controller.signal.throwIfAborted();
-      retireRead();
-      setSnapshot(next);
-      return next;
-    } catch (error) {
+    try {} catch (error) {
       if (
         !controller.signal.aborted &&
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] CallExpression
src/appearance-state.tsx:92:7
         snapshot.etag,
         controller.signal,
       );
-      controller.signal.throwIfAborted();
+      ;
       retireRead();
       setSnapshot(next);

[Killed] CallExpression
src/appearance-state.tsx:93:7
         controller.signal,
       );
       controller.signal.throwIfAborted();
-      retireRead();
+      ;
       setSnapshot(next);
       return next;
killedBy: @s30 invalidates a read started during a write when that write confirms
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  DARK
Received:
  LIGHT

[Killed] CallExpression
src/appearance-state.tsx:94:7
       );
       controller.signal.throwIfAborted();
       retireRead();
-      setSnapshot(next);
+      ;
       return next;
     } catch (error) {
killedBy: @s30 invalidates a read started during a write when that write confirms
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  DARK
Received:
  LIGHT

[Killed] BlockStatement
src/appearance-state.tsx:96:21
       retireRead();
       setSnapshot(next);
       return next;
-    } catch (error) {
-      if (
-        !controller.signal.aborted &&
-        !(error instanceof AppearanceValidationError)
-      )
-        setUncertain(true);
-      throw error;
-    } finally {
+    } catch (error) {} finally {
       if (writeRequest.current === controller) writeRequest.current = null;
     }
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/appearance-state.tsx:98:9
       return next;
     } catch (error) {
       if (
-        !controller.signal.aborted &&
-        !(error instanceof AppearanceValidationError)
+        false
       )
         setUncertain(true);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] LogicalOperator
src/appearance-state.tsx:98:9
       return next;
     } catch (error) {
       if (
-        !controller.signal.aborted &&
-        !(error instanceof AppearanceValidationError)
+        !controller.signal.aborted || !(error instanceof AppearanceValidationError)
       )
         setUncertain(true);
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p>, …(2) ] to have a length of 3 but got 4

[Killed] BooleanLiteral
src/appearance-state.tsx:99:9
     } catch (error) {
       if (
         !controller.signal.aborted &&
-        !(error instanceof AppearanceValidationError)
+        error instanceof AppearanceValidationError
       )
         setUncertain(true);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BooleanLiteral
src/appearance-state.tsx:101:22
         !controller.signal.aborted &&
         !(error instanceof AppearanceValidationError)
       )
-        setUncertain(true);
+        setUncertain(false);
       throw error;
     } finally {
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BlockStatement
src/appearance-state.tsx:103:15
       )
         setUncertain(true);
       throw error;
-    } finally {
-      if (writeRequest.current === controller) writeRequest.current = null;
-    }
+    } finally {}
   };
   useEffect(() => () => writeRequest.current?.abort(), []);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] EqualityOperator
src/appearance-state.tsx:104:11
         setUncertain(true);
       throw error;
     } finally {
-      if (writeRequest.current === controller) writeRequest.current = null;
+      if (writeRequest.current !== controller) writeRequest.current = null;
     }
   };
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance-state.tsx:104:11
         setUncertain(true);
       throw error;
     } finally {
-      if (writeRequest.current === controller) writeRequest.current = null;
+      if (false) writeRequest.current = null;
     }
   };
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ArrowFunction
src/appearance-state.tsx:107:19
       if (writeRequest.current === controller) writeRequest.current = null;
     }
   };
-  useEffect(() => () => writeRequest.current?.abort(), []);
+  useEffect(() => () => undefined, []);
   const load = useCallback(() => {
     if (readRequest.current)
killedBy: @s31 ignores Ana's late 'PUT' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: expected [ [ '/api/session', { …(3) } ], …(3) ] to have a length of 3 but got 4

[Killed] OptionalChaining
src/appearance-state.tsx:107:25
       if (writeRequest.current === controller) writeRequest.current = null;
     }
   };
-  useEffect(() => () => writeRequest.current?.abort(), []);
+  useEffect(() => () => writeRequest.current.abort(), []);
   const load = useCallback(() => {
     if (readRequest.current)
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Cannot read properties of null (reading 'abort')

[Killed] BlockStatement
src/appearance-state.tsx:108:34
     }
   };
   useEffect(() => () => writeRequest.current?.abort(), []);
-  const load = useCallback(() => {
-    if (readRequest.current)
-      return Promise.reject(new Error("Consulta de apariencia en curso"));
-    const controller = new AbortController();
-    readRequest.current = controller;
-    return readAppearance(controller.signal)
-      .then((next) => {
-        controller.signal.throwIfAborted();
-        setSnapshot(next);
-        setUncertain(false);
-        return next;
-      })
-      .catch((error) => {
-        if (!controller.signal.aborted) setFailed(true);
-        throw error;
-      })
-      .finally(() => {
-        if (readRequest.current === controller) {
-          readRequest.current = null;
-          setReading(false);
-        }
-      });
-  }, []);
+  const load = useCallback(() => {}, []);
   const reload = () => {
     setFailed(false);
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Cannot read properties of undefined (reading 'catch')

[Killed] ConditionalExpression
src/appearance-state.tsx:109:9
   };
   useEffect(() => () => writeRequest.current?.abort(), []);
   const load = useCallback(() => {
-    if (readRequest.current)
+    if (true)
       return Promise.reject(new Error("Consulta de apariencia en curso"));
     const controller = new AbortController();
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"
