[Killed] BooleanLiteral
src/work-session-reader.tsx:255:42
             </label>
             <textarea
               id={`${fieldsId}-next`}
-              aria-invalid={noteError && !validNote(nextStep)}
+              aria-invalid={noteError && validNote(nextStep)}
               aria-describedby={noteError ? `${fieldsId}-error` : undefined}
               readOnly={busy}
killedBy: @s5 preserves an overlong draft and rejects it before transmitting
statusReason: expect(element).toHaveAttribute("aria-invalid", "true") // element.getAttribute("aria-invalid") === "true"

Expected the element to have attribute:
  aria-invalid="true"
Received:
  aria-invalid="false"
