[Survived] ConditionalExpression
src/appearance-state.tsx:109:9
   };
   useEffect(() => () => writeRequest.current?.abort(), []);
   const load = useCallback(() => {
-    if (readRequest.current)
+    if (false)
       return Promise.reject(new Error("Consulta de apariencia en curso"));
     const controller = new AbortController();

[NoCoverage] StringLiteral
src/appearance-state.tsx:110:39
   useEffect(() => () => writeRequest.current?.abort(), []);
   const load = useCallback(() => {
     if (readRequest.current)
-      return Promise.reject(new Error("Consulta de apariencia en curso"));
+      return Promise.reject(new Error(""));
     const controller = new AbortController();
     readRequest.current = controller;

[Killed] BlockStatement
src/appearance-state.tsx:114:23
     const controller = new AbortController();
     readRequest.current = controller;
     return readAppearance(controller.signal)
-      .then((next) => {
-        controller.signal.throwIfAborted();
-        setSnapshot(next);
-        setUncertain(false);
-        return next;
-      })
+      .then((next) => {})
       .catch((error) => {
         if (!controller.signal.aborted) setFailed(true);
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Survived] CallExpression
src/appearance-state.tsx:115:9
     readRequest.current = controller;
     return readAppearance(controller.signal)
       .then((next) => {
-        controller.signal.throwIfAborted();
+        ;
         setSnapshot(next);
         setUncertain(false);

[Killed] CallExpression
src/appearance-state.tsx:116:9
     return readAppearance(controller.signal)
       .then((next) => {
         controller.signal.throwIfAborted();
-        setSnapshot(next);
+        ;
         setUncertain(false);
         return next;
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] BooleanLiteral
src/appearance-state.tsx:117:22
       .then((next) => {
         controller.signal.throwIfAborted();
         setSnapshot(next);
-        setUncertain(false);
+        setUncertain(true);
         return next;
       })
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/appearance-state.tsx:120:25
         setUncertain(false);
         return next;
       })
-      .catch((error) => {
-        if (!controller.signal.aborted) setFailed(true);
-        throw error;
-      })
+      .catch((error) => {})
       .finally(() => {
         if (readRequest.current === controller) {
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BooleanLiteral
src/appearance-state.tsx:121:13
         return next;
       })
       .catch((error) => {
-        if (!controller.signal.aborted) setFailed(true);
+        if (controller.signal.aborted) setFailed(true);
         throw error;
       })
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BooleanLiteral
src/appearance-state.tsx:121:51
         return next;
       })
       .catch((error) => {
-        if (!controller.signal.aborted) setFailed(true);
+        if (!controller.signal.aborted) setFailed(false);
         throw error;
       })
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BlockStatement
src/appearance-state.tsx:124:22
         if (!controller.signal.aborted) setFailed(true);
         throw error;
       })
-      .finally(() => {
-        if (readRequest.current === controller) {
-          readRequest.current = null;
-          setReading(false);
-        }
-      });
+      .finally(() => {});
   }, []);
   const reload = () => {
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  style=""
>
  <head />
  <body>

[Killed] ConditionalExpression
src/appearance-state.tsx:125:13
         throw error;
       })
       .finally(() => {
-        if (readRequest.current === controller) {
+        if (true) {
           readRequest.current = null;
           setReading(false);
killedBy: @s24 follows a system color-scheme change without persisting another preference
statusReason: expected '' to be 'dark' // Object.is equality

[Killed] ConditionalExpression
src/appearance-state.tsx:125:13
         throw error;
       })
       .finally(() => {
-        if (readRequest.current === controller) {
+        if (false) {
           readRequest.current = null;
           setReading(false);
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  style=""
>
  <head />
  <body>

[Killed] BlockStatement
src/appearance-state.tsx:131:24
         }
       });
   }, []);
-  const reload = () => {
-    setFailed(false);
-    setReading(true);
-    return load();
-  };
+  const reload = () => {};
   useEffect(() => {
     if (!snapshot) return;
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find role="radio" and name "Claro"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/appearance-state.tsx:132:15
       });
   }, []);
   const reload = () => {
-    setFailed(false);
+    setFailed(true);
     setReading(true);
     return load();
killedBy: @s37 Recargar versión guardada clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/appearance-state.tsx:133:16
   }, []);
   const reload = () => {
     setFailed(false);
-    setReading(true);
+    setReading(false);
     return load();
   };
killedBy: @s29 retains uncertainty after failed recovery and announces the next pending consultation: 503
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] BooleanLiteral
src/appearance-state.tsx:137:9
     return load();
   };
   useEffect(() => {
-    if (!snapshot) return;
+    if (snapshot) return;
     const media =
       snapshot.theme === "SYSTEM"
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Cannot read properties of undefined (reading 'theme')

[Killed] ConditionalExpression
src/appearance-state.tsx:137:9
     return load();
   };
   useEffect(() => {
-    if (!snapshot) return;
+    if (true) return;
     const media =
       snapshot.theme === "SYSTEM"
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/appearance-state.tsx:139:7
   useEffect(() => {
     if (!snapshot) return;
     const media =
-      snapshot.theme === "SYSTEM"
+      snapshot.theme !== "SYSTEM"
         ? window.matchMedia?.("(prefers-color-scheme: dark)")
         : undefined;
killedBy: @s24 refreshes the system scheme after suspension without polling or writing
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] ConditionalExpression
src/appearance-state.tsx:139:7
   useEffect(() => {
     if (!snapshot) return;
     const media =
-      snapshot.theme === "SYSTEM"
+      false
         ? window.matchMedia?.("(prefers-color-scheme: dark)")
         : undefined;
killedBy: @s24 refreshes the system scheme after suspension without polling or writing
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] OptionalChaining
src/appearance-state.tsx:140:11
     if (!snapshot) return;
     const media =
       snapshot.theme === "SYSTEM"
-        ? window.matchMedia?.("(prefers-color-scheme: dark)")
+        ? window.matchMedia("(prefers-color-scheme: dark)")
         : undefined;
     const apply = () => {
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: Unable to find role="radio" and name "Sistema"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
src/appearance-state.tsx:140:31
     if (!snapshot) return;
     const media =
       snapshot.theme === "SYSTEM"
-        ? window.matchMedia?.("(prefers-color-scheme: dark)")
+        ? window.matchMedia?.("")
         : undefined;
     const apply = () => {
killedBy: @s24 follows a system color-scheme change without persisting another preference
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] BlockStatement
src/appearance-state.tsx:142:25
       snapshot.theme === "SYSTEM"
         ? window.matchMedia?.("(prefers-color-scheme: dark)")
         : undefined;
-    const apply = () => {
-      const theme =
-        snapshot.theme === "DARK" ||
-        (snapshot.theme === "SYSTEM" && media?.matches)
-          ? "dark"
-          : "light";
-      document.documentElement.dataset.theme = theme;
-      document.documentElement.style.colorScheme = theme;
-      paintThemeColor();
-      document.documentElement.style.setProperty(
-        "--accent",
-        theme === "dark" ? snapshot.accentDark : snapshot.accentLight,
-      );
-    };
+    const apply = () => {};
     apply();
     media?.addEventListener("change", apply);
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/appearance-state.tsx:144:9
         : undefined;
     const apply = () => {
       const theme =
-        snapshot.theme === "DARK" ||
-        (snapshot.theme === "SYSTEM" && media?.matches)
+        true
           ? "dark"
           : "light";
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: expected 'dark' to be 'light' // Object.is equality

[Killed] LogicalOperator
src/appearance-state.tsx:144:9
         : undefined;
     const apply = () => {
       const theme =
-        snapshot.theme === "DARK" ||
-        (snapshot.theme === "SYSTEM" && media?.matches)
+        snapshot.theme === "DARK" && snapshot.theme === "SYSTEM" && media?.matches
           ? "dark"
           : "light";
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected 'light' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  data-theme="light"
  style="color-scheme: light; --accent: #0000FF;"
>
  <head />

[Killed] ConditionalExpression
src/appearance-state.tsx:145:10
     const apply = () => {
       const theme =
         snapshot.theme === "DARK" ||
-        (snapshot.theme === "SYSTEM" && media?.matches)
+        (false)
           ? "dark"
           : "light";
killedBy: @s24 refreshes the system scheme after suspension without polling or writing
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] OptionalChaining
src/appearance-state.tsx:145:41
     const apply = () => {
       const theme =
         snapshot.theme === "DARK" ||
-        (snapshot.theme === "SYSTEM" && media?.matches)
+        (snapshot.theme === "SYSTEM" && media.matches)
           ? "dark"
           : "light";
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: Unable to find role="radio" and name "Sistema"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
src/appearance-state.tsx:146:13
       const theme =
         snapshot.theme === "DARK" ||
         (snapshot.theme === "SYSTEM" && media?.matches)
-          ? "dark"
+          ? ""
           : "light";
       document.documentElement.dataset.theme = theme;
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  data-theme=""
  style="--accent: #0000FF;"
>
  <head />

[Killed] CallExpression
src/appearance-state.tsx:150:7
           : "light";
       document.documentElement.dataset.theme = theme;
       document.documentElement.style.colorScheme = theme;
-      paintThemeColor();
+      ;
       document.documentElement.style.setProperty(
         "--accent",
killedBy: applying DARK paints theme-color with the computed dark canvas (audit #5)
statusReason: expected '#000000' to be '#111827' // Object.is equality

[Killed] ConditionalExpression
src/appearance-state.tsx:153:9
       paintThemeColor();
       document.documentElement.style.setProperty(
         "--accent",
-        theme === "dark" ? snapshot.accentDark : snapshot.accentLight,
+        false ? snapshot.accentDark : snapshot.accentLight,
       );
     };
killedBy: @s22 prepares defaults locally and requires an explicit save
statusReason: expected '#0000FF' to be '#00FFFF' // Object.is equality

[Killed] EqualityOperator
src/appearance-state.tsx:153:9
       paintThemeColor();
       document.documentElement.style.setProperty(
         "--accent",
-        theme === "dark" ? snapshot.accentDark : snapshot.accentLight,
+        theme !== "dark" ? snapshot.accentDark : snapshot.accentLight,
       );
     };
killedBy: @s22 prepares defaults locally and requires an explicit save
statusReason: expected '#0000FF' to be '#00FFFF' // Object.is equality

[Killed] CallExpression
src/appearance-state.tsx:156:5
         theme === "dark" ? snapshot.accentDark : snapshot.accentLight,
       );
     };
-    apply();
+    ;
     media?.addEventListener("change", apply);
     document.addEventListener("visibilitychange", apply);
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] OptionalChaining
src/appearance-state.tsx:157:5
       );
     };
     apply();
-    media?.addEventListener("change", apply);
+    media.addEventListener("change", apply);
     document.addEventListener("visibilitychange", apply);
     return () => {
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find an accessible element with the role "region" and name "Vista previa clara"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BlockStatement
src/appearance-state.tsx:159:18
     apply();
     media?.addEventListener("change", apply);
     document.addEventListener("visibilitychange", apply);
-    return () => {
-      media?.removeEventListener("change", apply);
-      document.removeEventListener("visibilitychange", apply);
-      delete document.documentElement.dataset.theme;
-      document.documentElement.style.removeProperty("color-scheme");
-      document.documentElement.style.removeProperty("--accent");
-      paintThemeColor();
-    };
+    return () => {};
   }, [snapshot]);
   useEffect(() => {
killedBy: @s32 does not carry confirmed appearance or drafts into a different authenticated owner
statusReason: expected '#00FFFF' to be '' // Object.is equality

[Killed] OptionalChaining
src/appearance-state.tsx:160:7
     media?.addEventListener("change", apply);
     document.addEventListener("visibilitychange", apply);
     return () => {
-      media?.removeEventListener("change", apply);
+      media.removeEventListener("change", apply);
       document.removeEventListener("visibilitychange", apply);
       delete document.documentElement.dataset.theme;
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Cannot read properties of undefined (reading 'removeEventListener')

[Killed] CallExpression
src/appearance-state.tsx:165:7
       delete document.documentElement.dataset.theme;
       document.documentElement.style.removeProperty("color-scheme");
       document.documentElement.style.removeProperty("--accent");
-      paintThemeColor();
+      ;
     };
   }, [snapshot]);
killedBy: leaving the session returns theme-color to the system canvas (@s32)
statusReason: expected '#111827' to be '#f8f9f5' // Object.is equality

[Killed] BlockStatement
src/appearance-state.tsx:168:19
       paintThemeColor();
     };
   }, [snapshot]);
-  useEffect(() => {
-    void load().catch(() => {});
-    return () => {
-      readRequest.current?.abort();
-      readRequest.current = null;
-    };
-  }, [load]);
+  useEffect(() => {}, [load]);
   return (
     <AppearanceContext
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] BlockStatement
src/appearance-state.tsx:170:18
   }, [snapshot]);
   useEffect(() => {
     void load().catch(() => {});
-    return () => {
-      readRequest.current?.abort();
-      readRequest.current = null;
-    };
+    return () => {};
   }, [load]);
   return (
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: expected [ [ '/api/session', { …(3) } ], …(3) ] to have a length of 3 but got 4

[Killed] OptionalChaining
src/appearance-state.tsx:171:7
   useEffect(() => {
     void load().catch(() => {});
     return () => {
-      readRequest.current?.abort();
+      readRequest.current.abort();
       readRequest.current = null;
     };
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Cannot read properties of null (reading 'abort')

[Killed] ObjectLiteral
src/appearance-state.tsx:177:14
   }, [load]);
   return (
     <AppearanceContext
-      value={{
-        snapshot,
-        failed,
-        reading,
-        uncertain,
-        reload,
-        save,
-        refreshAfterImport: async () => {
-          if (uncertain || writeRequest.current)
-            throw new Error(
-              "Recupera primero el guardado de apariencia pendiente",
-            );
-          return reload();
-        },
-      }}
+      value={{}}
     >
       {failed && !snapshot && (
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] BlockStatement
src/appearance-state.tsx:184:41
         uncertain,
         reload,
         save,
-        refreshAfterImport: async () => {
-          if (uncertain || writeRequest.current)
-            throw new Error(
-              "Recupera primero el guardado de apariencia pendiente",
-            );
-          return reload();
-        },
+        refreshAfterImport: async () => {},
       }}
     >
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected 'light' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  data-theme="light"
  style="color-scheme: light; --accent: #244C3C;"
>
  <head />

[Killed] ConditionalExpression
src/appearance-state.tsx:185:15
         reload,
         save,
         refreshAfterImport: async () => {
-          if (uncertain || writeRequest.current)
+          if (true)
             throw new Error(
               "Recupera primero el guardado de apariencia pendiente",
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected 'light' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  data-theme="light"
  style="color-scheme: light; --accent: #244C3C;"
>
  <head />

[Killed] LogicalOperator
src/appearance-state.tsx:185:15
         reload,
         save,
         refreshAfterImport: async () => {
-          if (uncertain || writeRequest.current)
+          if (uncertain && writeRequest.current)
             throw new Error(
               "Recupera primero el guardado de apariencia pendiente",
killedBy: @s41 refreshes imported appearance preserving prior operation (uncertain)
statusReason: Unable to find an element with the text: /La importación está confirmada, pero/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance-state.tsx:193:8
         },
       }}
     >
-      {failed && !snapshot && (
-        <div className="appearance-load-error">
-          <p role="alert">
-            No se pudo cargar la apariencia. Usamos temporalmente valores
-            seguros.
-          </p>
-          <button
-            onClick={(event) => {
-              retryInitiator.current = event.currentTarget;
-              void reload().catch(() => {});
-            }}
-          >
-            Reintentar
-          </button>
-        </div>
-      )}
+      {false}
       {children}
     </AppearanceContext>
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance-state.tsx:193:8
         },
       }}
     >
-      {failed && !snapshot && (
-        <div className="appearance-load-error">
-          <p role="alert">
-            No se pudo cargar la apariencia. Usamos temporalmente valores
-            seguros.
-          </p>
-          <button
-            onClick={(event) => {
-              retryInitiator.current = event.currentTarget;
-              void reload().catch(() => {});
-            }}
-          >
-            Reintentar
-          </button>
-        </div>
-      )}
+      {true}
       {children}
     </AppearanceContext>
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BlockStatement
src/appearance-state.tsx:200:33
             seguros.
           </p>
           <button
-            onClick={(event) => {
-              retryInitiator.current = event.currentTarget;
-              void reload().catch(() => {});
-            }}
+            onClick={(event) => {}}
           >
             Reintentar
killedBy: @s26 announces an initial appearance failure while other functions remain usable
statusReason: expected '' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
