[Killed] ConditionalExpression
src/work-session-reader.tsx:242:29
             </label>
             <textarea
               id={`${fieldsId}-progress`}
-              aria-invalid={noteError && !validNote(progressNote)}
+              aria-invalid={false}
               aria-describedby={noteError ? `${fieldsId}-error` : undefined}
               readOnly={busy}
killedBy: @s5 associates a progress-only note error without marking the valid next step invalid
statusReason: expect(element).toHaveAttribute("aria-invalid", "true") // element.getAttribute("aria-invalid") === "true"

Expected the element to have attribute:
  aria-invalid="true"
Received:
  aria-invalid="false"
