[Killed] ConditionalExpression
src/App.tsx:32:22
   const weeklyReview = /^\/revision-semanal(?:\?[^#]*)?$/.test(route);
   const history = /^\/historial(?:\?[^#]*)?$/.test(route);
   const availability = route === "/disponibilidad";
-  const appearance = route === "/apariencia";
+  const appearance = false;
   const exportData = route === "/exportacion";
   const importData = route === "/importacion";
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] EqualityOperator
src/App.tsx:32:22
   const weeklyReview = /^\/revision-semanal(?:\?[^#]*)?$/.test(route);
   const history = /^\/historial(?:\?[^#]*)?$/.test(route);
   const availability = route === "/disponibilidad";
-  const appearance = route === "/apariencia";
+  const appearance = route !== "/apariencia";
   const exportData = route === "/exportacion";
   const importData = route === "/importacion";
killedBy: @s50 IDEMPOTENCY_CONFLICT conserva key e intención bloqueadas y sólo consulta su resultado
statusReason: Unable to find role="button" and name "Planificar bloque"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/App.tsx:51:19
               ? "Exportación"
               : appearance
                 ? "Apariencia"
-                : route === "/"
+                : true
                   ? "Hoy"
                   : weeklyReview
killedBy: @s47 navega a Disponibilidad con aviso y salida determinista
statusReason: expect(element).toHaveAttribute("aria-current", "page") // element.getAttribute("aria-current") === "page"

Expected the element to have attribute:
  aria-current="page"
Received:
  null

[Killed] EqualityOperator
src/App.tsx:51:19
               ? "Exportación"
               : appearance
                 ? "Apariencia"
-                : route === "/"
+                : route !== "/"
                   ? "Hoy"
                   : weeklyReview
killedBy: @s47 navega a Disponibilidad con aviso y salida determinista
statusReason: expect(element).toHaveAttribute("aria-current", "page") // element.getAttribute("aria-current") === "page"

Expected the element to have attribute:
  aria-current="page"
Received:
  null

[Killed] MethodExpression
src/App.tsx:59:27
                       ? "Historial"
                       : availability
                         ? "Disponibilidad"
-                        : route.startsWith("/proyectos")
+                        : route.endsWith("/proyectos")
                           ? "Proyectos"
                           : null
killedBy: @s36 navigation and breadcrumb reflect /proyectos/nuevo with one active section
statusReason: expect(element).toHaveAttribute("aria-current", "page") // element.getAttribute("aria-current") === "page"

Expected the element to have attribute:
  aria-current="page"
Received:
  null

[Killed] ConditionalExpression
src/App.tsx:80:11
         <ExportData owner={username} />
       ) : appearance ? (
         <Appearance />
-      ) : route === "/" ? (
+      ) : false ? (
         <Today />
       ) : route === "/proyectos/nuevo" ? (
killedBy: @s47 login no acepta una variante de la ruta exacta: /disponibilidad-extra
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] EqualityOperator
src/App.tsx:80:11
         <ExportData owner={username} />
       ) : appearance ? (
         <Appearance />
-      ) : route === "/" ? (
+      ) : route !== "/" ? (
         <Today />
       ) : route === "/proyectos/nuevo" ? (
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find role="heading" and name "Historial"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/App.tsx:82:11
         <Appearance />
       ) : route === "/" ? (
         <Today />
-      ) : route === "/proyectos/nuevo" ? (
+      ) : false ? (
         <CreateProjectScreen />
       ) : weeklyReview ? (
killedBy: @s32 @s35 resolves route /proyectos/nuevo without accidental project reads
statusReason: Unable to find a label with the text of: /Nombre del proyecto/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/App.tsx:82:11
         <Appearance />
       ) : route === "/" ? (
         <Today />
-      ) : route === "/proyectos/nuevo" ? (
+      ) : true ? (
         <CreateProjectScreen />
       ) : weeklyReview ? (
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find role="heading" and name "Historial"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] Regex
src/App.tsx:104:11
           id={taskRoute[2]}
           customization={customization}
         />
-      ) : /^\/proyectos\/[^/?]+\/editar$/.test(route) ? (
+      ) : /\/proyectos\/[^/?]+\/editar$/.test(route) ? (
         <ProjectEditor key={route} route={route} />
       ) : /^\/proyectos(?:\?[^#]*|\/[^/?]+)?$/.test(route) ? (
killedBy: @s35 unknown route /extra/proyectos/id/editar remains private 404 without reads or active navigation
statusReason: Unable to find an accessible element with the role "heading" and name "Página no encontrada"

Here are the accessible roles:

  paragraph:

  Name "":
  <p

[Killed] Regex
src/App.tsx:104:11
           id={taskRoute[2]}
           customization={customization}
         />
-      ) : /^\/proyectos\/[^/?]+\/editar$/.test(route) ? (
+      ) : /^\/proyectos\/[/?]+\/editar$/.test(route) ? (
         <ProjectEditor key={route} route={route} />
       ) : /^\/proyectos(?:\?[^#]*|\/[^/?]+)?$/.test(route) ? (
killedBy: @s6 lectura privada /proyectos/6c5dbd10-9ad5-4000-8000-000000000001/editar también invalida acceso
statusReason: Unable to find a label with the text of: Usuario

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] Regex
src/App.tsx:106:11
         />
       ) : /^\/proyectos\/[^/?]+\/editar$/.test(route) ? (
         <ProjectEditor key={route} route={route} />
-      ) : /^\/proyectos(?:\?[^#]*|\/[^/?]+)?$/.test(route) ? (
+      ) : /^\/proyectos(?:\?[^#]*|\/[/?]+)?$/.test(route) ? (
         <ProjectReader
           key={route}
killedBy: @s16 conserva la ruta propia tras login /proyectos/6c5dbd10-9ad5-4000-8000-000000000001
statusReason: expected "vi.fn()" to be called 4 times, but got 3 times

Ignored nodes: comments, script, style
<html
  data-theme="light"
  style="color-scheme: light; --accent: #244C3C;"
>
  <head />

[Killed] Regex
src/App.tsx:106:11
         />
       ) : /^\/proyectos\/[^/?]+\/editar$/.test(route) ? (
         <ProjectEditor key={route} route={route} />
-      ) : /^\/proyectos(?:\?[^#]*|\/[^/?]+)?$/.test(route) ? (
+      ) : /^\/proyectos(?:\?[#]*|\/[^/?]+)?$/.test(route) ? (
         <ProjectReader
           key={route}
killedBy: @s27 retira datos anteriores ante401 en /proyectos?cursor=older
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] UnaryOperator
src/App.tsx:113:40
           customization={customization}
         />
       ) : (
-        <main id="proyectos" tabIndex={-1}>
+        <main id="proyectos" tabIndex={+1}>
           <h1>Página no encontrada</h1>
           <RouteLink href="/">Hoy</RouteLink>
killedBy: @s35 unknown route /extra/proyectos/id/editar remains private 404 without reads or active navigation
statusReason: expect(element).toHaveAttribute("tabindex", "-1") // element.getAttribute("tabindex") === "-1"

Expected the element to have attribute:
  tabindex="-1"
Received:
  tabindex="1"
