[Killed] StringLiteral
src/work-session-reader.tsx:232:20
             />
           </p>
           {noteError && (
-            <p id={`${fieldsId}-error`} role="alert">
+            <p id={``} role="alert">
               Cada nota admite hasta 2.000 caracteres válidos.
             </p>
killedBy: @s5 preserves an overlong draft and rejects it before transmitting
statusReason: expect(element).toHaveAttribute("aria-describedby", "") // element.getAttribute("aria-describedby") === ""

Expected the element to have attribute:
  aria-describedby=""
Received:
  aria-describedby="_r_0_-error"

[Killed] BooleanLiteral
src/work-session-reader.tsx:242:42
             </label>
             <textarea
               id={`${fieldsId}-progress`}
-              aria-invalid={noteError && !validNote(progressNote)}
+              aria-invalid={noteError && validNote(progressNote)}
               aria-describedby={noteError ? `${fieldsId}-error` : undefined}
               readOnly={busy}
killedBy: @s5 preserves an overlong draft and rejects it before transmitting
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] LogicalOperator
src/work-session-reader.tsx:242:29
             </label>
             <textarea
               id={`${fieldsId}-progress`}
-              aria-invalid={noteError && !validNote(progressNote)}
+              aria-invalid={noteError || !validNote(progressNote)}
               aria-describedby={noteError ? `${fieldsId}-error` : undefined}
               readOnly={busy}
killedBy: @s5 preserves an overlong draft and rejects it before transmitting
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] ConditionalExpression
src/work-session-reader.tsx:255:29
             </label>
             <textarea
               id={`${fieldsId}-next`}
-              aria-invalid={noteError && !validNote(nextStep)}
+              aria-invalid={true}
               aria-describedby={noteError ? `${fieldsId}-error` : undefined}
               readOnly={busy}
killedBy: @s5 associates a progress-only note error without marking the valid next step invalid
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] ConditionalExpression
src/work-session-reader.tsx:255:29
             </label>
             <textarea
               id={`${fieldsId}-next`}
-              aria-invalid={noteError && !validNote(nextStep)}
+              aria-invalid={false}
               aria-describedby={noteError ? `${fieldsId}-error` : undefined}
               readOnly={busy}
killedBy: @s5 preserves an overlong draft and rejects it before transmitting
statusReason: expect(element).toHaveAttribute("aria-invalid", "true") // element.getAttribute("aria-invalid") === "true"

Expected the element to have attribute:
  aria-invalid="true"
Received:
  aria-invalid="false"

[Killed] ArrowFunction
src/work-session-reader.tsx:331:12
       .finally(() => {
         if (!controller.signal.aborted) setLoading(false);
       });
-    return () => controller.abort();
+    return () => undefined;
   }, [refresh]);
   return (
killedBy: @s38 a late active HTTP401 after confirmed close cannot revoke the new reader access
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      401,

[Killed] ConditionalExpression
src/work-session-reader.tsx:357:15
       <button
         aria-disabled={loading}
         onClick={() => {
-          if (loading) return;
+          if (true) return;
           setLoading(true);
           setFailed(false);
killedBy: @s34 preserves confirmed notes when the separate active lookup fails and retries that lookup only
statusReason: Unable to find an element with the text: No hay ninguna sesión abierta.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="reader work-session"
      id="proyectos"

[Killed] ConditionalExpression
src/work-session-reader.tsx:357:15
       <button
         aria-disabled={loading}
         onClick={() => {
-          if (loading) return;
+          if (false) return;
           setLoading(true);
           setFailed(false);
killedBy: @s40 retrying the active lookup announces pending and coalesces another click
statusReason: expected 3 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <main

[Killed] BooleanLiteral
src/work-session-reader.tsx:358:22
         aria-disabled={loading}
         onClick={() => {
           if (loading) return;
-          setLoading(true);
+          setLoading(false);
           setFailed(false);
           setActive(undefined);
killedBy: @s40 retrying the active lookup announces pending and coalesces another click
statusReason: Unable to find an element with the text: Consultando sesión abierta. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="reader work-session"
      id="proyectos"
