[Killed] BooleanLiteral
src/session-gate.tsx:32:45
       }
     }
   }, [session?.authenticated, closing, closeError, failure, saving]);
-  if (session?.authenticated && !closing && !closeError && !failure)
+  if (session?.authenticated && !closing && closeError && !failure)
     return (
       <AppearanceProvider key={session.username}>
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: Unable to find an element with the text: Consultando apariencia…. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="session-screen"
    >

[Killed] OptionalChaining
src/session-gate.tsx:32:7
       }
     }
   }, [session?.authenticated, closing, closeError, failure, saving]);
-  if (session?.authenticated && !closing && !closeError && !failure)
+  if (session.authenticated && !closing && !closeError && !failure)
     return (
       <AppearanceProvider key={session.username}>
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: Cannot read properties of undefined (reading 'authenticated')

[Killed] BooleanLiteral
src/session-gate.tsx:35:50
   if (session?.authenticated && !closing && !closeError && !failure)
     return (
       <AppearanceProvider key={session.username}>
-        <div className="access-recovery" hidden={!csrfExpired}>
+        <div className="access-recovery" hidden={csrfExpired}>
           <p role={csrfExpired ? "alert" : undefined}>
             {recoveryFailed ? "No hemos podido renovar el acceso. " : ""}La
killedBy: @s51 recuperar CSRF conserva petición y exige reenvío manual con token renovado
statusReason: Unable to find an accessible element with the role "button" and name "Recuperar acceso"

Here are the accessible roles:

  alert:

  Name "":
  <p

[Killed] ArrowFunction
src/session-gate.tsx:41:28
             protección de tu sesión necesita renovarse. Recupera el acceso y
             decide si vuelves a enviar los cambios.
           </p>
-          <button onClick={() => refresh(true)}>Recuperar acceso</button>
+          <button onClick={() => undefined}>Recuperar acceso</button>
         </div>
         <App
killedBy: @s51 recuperar CSRF conserva petición y exige reenvío manual con token renovado
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/session-gate.tsx:41:42
             protección de tu sesión necesita renovarse. Recupera el acceso y
             decide si vuelves a enviar los cambios.
           </p>
-          <button onClick={() => refresh(true)}>Recuperar acceso</button>
+          <button onClick={() => refresh(false)}>Recuperar acceso</button>
         </div>
         <App
killedBy: @s17 recuperar CSRF con red caída conserva el borrador y permite otra comprobación
statusReason: Unable to find an element with the display value: Conservar.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="session-screen"
    >
