[Killed] StringLiteral
src/appearance-api.ts:26:3
   "#111827",
   "#1F2937",
   "#182232",
-  "#0B1220",
+  "",
   "#28394A",
   "#33485C",
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] StringLiteral
src/appearance-api.ts:27:3
   "#1F2937",
   "#182232",
   "#0B1220",
-  "#28394A",
+  "",
   "#33485C",
 ];
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] BlockStatement
src/appearance-api.ts:30:35
   "#28394A",
   "#33485C",
 ];
-function luminance(color: string) {
-  const channels = [1, 3, 5].map((start) => {
-    const channel = parseInt(color.slice(start, start + 2), 16) / 255;
-    return channel <= 0.04045
-      ? channel / 12.92
-      : ((channel + 0.055) / 1.055) ** 2.4;
-  });
-  return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
-}
+function luminance(color: string) {}
 function validAccent(value: unknown, surfaces: string[]): value is string {
   if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return false;
killedBy: @s1 un reintento tras fallo de comprobación no vuelve a montar datos antiguos
statusReason: finish is not a function

[Killed] BlockStatement
src/appearance-api.ts:31:45
   "#33485C",
 ];
 function luminance(color: string) {
-  const channels = [1, 3, 5].map((start) => {
-    const channel = parseInt(color.slice(start, start + 2), 16) / 255;
-    return channel <= 0.04045
-      ? channel / 12.92
-      : ((channel + 0.055) / 1.055) ** 2.4;
-  });
+  const channels = [1, 3, 5].map((start) => {});
   return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
 }
killedBy: @s1 un reintento tras fallo de comprobación no vuelve a montar datos antiguos
statusReason: finish is not a function

[Killed] ArrayDeclaration
src/appearance-api.ts:31:20
   "#33485C",
 ];
 function luminance(color: string) {
-  const channels = [1, 3, 5].map((start) => {
+  const channels = [].map((start) => {
     const channel = parseInt(color.slice(start, start + 2), 16) / 255;
     return channel <= 0.04045
killedBy: @s1 un reintento tras fallo de comprobación no vuelve a montar datos antiguos
statusReason: finish is not a function

[Killed] MethodExpression
src/appearance-api.ts:32:30
 ];
 function luminance(color: string) {
   const channels = [1, 3, 5].map((start) => {
-    const channel = parseInt(color.slice(start, start + 2), 16) / 255;
+    const channel = parseInt(color, 16) / 255;
     return channel <= 0.04045
       ? channel / 12.92
killedBy: @s1 un reintento tras fallo de comprobación no vuelve a montar datos antiguos
statusReason: finish is not a function

[Killed] ArithmeticOperator
src/appearance-api.ts:32:49
 ];
 function luminance(color: string) {
   const channels = [1, 3, 5].map((start) => {
-    const channel = parseInt(color.slice(start, start + 2), 16) / 255;
+    const channel = parseInt(color.slice(start, start - 2), 16) / 255;
     return channel <= 0.04045
       ? channel / 12.92
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected '' to be 'light' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/appearance-api.ts:33:12
 function luminance(color: string) {
   const channels = [1, 3, 5].map((start) => {
     const channel = parseInt(color.slice(start, start + 2), 16) / 255;
-    return channel <= 0.04045
+    return channel > 0.04045
       ? channel / 12.92
       : ((channel + 0.055) / 1.055) ** 2.4;
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected '' to be 'light' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/appearance-api.ts:33:12
 function luminance(color: string) {
   const channels = [1, 3, 5].map((start) => {
     const channel = parseInt(color.slice(start, start + 2), 16) / 255;
-    return channel <= 0.04045
+    return false
       ? channel / 12.92
       : ((channel + 0.055) / 1.055) ** 2.4;
killedBy: @s34 @s35 distinguishes initial authenticated=false from anonymous login on an unknown local route
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/appearance-api.ts:34:9
   const channels = [1, 3, 5].map((start) => {
     const channel = parseInt(color.slice(start, start + 2), 16) / 255;
     return channel <= 0.04045
-      ? channel / 12.92
+      ? channel * 12.92
       : ((channel + 0.055) / 1.055) ** 2.4;
   });
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ArithmeticOperator
src/appearance-api.ts:35:11
     const channel = parseInt(color.slice(start, start + 2), 16) / 255;
     return channel <= 0.04045
       ? channel / 12.92
-      : ((channel + 0.055) / 1.055) ** 2.4;
+      : ((channel - 0.055) / 1.055) ** 2.4;
   });
   return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected '' to be 'light' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
src/appearance-api.ts:35:10
     const channel = parseInt(color.slice(start, start + 2), 16) / 255;
     return channel <= 0.04045
       ? channel / 12.92
-      : ((channel + 0.055) / 1.055) ** 2.4;
+      : ((channel + 0.055) * 1.055) ** 2.4;
   });
   return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
killedBy: @s11 does not round a contrast below the required threshold upward
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] ArithmeticOperator
src/appearance-api.ts:37:33
       ? channel / 12.92
       : ((channel + 0.055) / 1.055) ** 2.4;
   });
-  return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
+  return channels[0] * 0.2126 + channels[1] / 0.7152 + channels[2] * 0.0722;
 }
 function validAccent(value: unknown, surfaces: string[]): value is string {
killedBy: @s11 does not round a contrast below the required threshold upward
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] ArithmeticOperator
src/appearance-api.ts:37:10
       ? channel / 12.92
       : ((channel + 0.055) / 1.055) ** 2.4;
   });
-  return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
+  return channels[0] * 0.2126 + channels[1] * 0.7152 - channels[2] * 0.0722;
 }
 function validAccent(value: unknown, surfaces: string[]): value is string {
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected 'light' to be 'dark' // Object.is equality

Ignored nodes: comments, script, style
<html
  data-theme="light"
  style="color-scheme: light; --accent: #244C3C;"
>
  <head />

[Killed] BlockStatement
src/appearance-api.ts:39:75
   });
   return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
 }
-function validAccent(value: unknown, surfaces: string[]): value is string {
-  if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return false;
-  const foreground = luminance(value);
-  return surfaces.every((surface) => {
-    const background = luminance(surface);
-    return (
-      (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
-      4.5
-    );
-  });
-}
+function validAccent(value: unknown, surfaces: string[]): value is string {}
 export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
   return validAccent(
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected '' to be 'light' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/appearance-api.ts:40:74
   return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
 }
 function validAccent(value: unknown, surfaces: string[]): value is string {
-  if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return false;
+  if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return true;
   const foreground = luminance(value);
   return surfaces.every((surface) => {
killedBy: @s18 refinement rejects a noncanonical HEX #0000FFsuffix
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:40:7
   return channels[0] * 0.2126 + channels[1] * 0.7152 + channels[2] * 0.0722;
 }
 function validAccent(value: unknown, surfaces: string[]): value is string {
-  if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return false;
+  if (true) return false;
   const foreground = luminance(value);
   return surfaces.every((surface) => {
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected '' to be 'light' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] MethodExpression
src/appearance-api.ts:42:10
 function validAccent(value: unknown, surfaces: string[]): value is string {
   if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return false;
   const foreground = luminance(value);
-  return surfaces.every((surface) => {
-    const background = luminance(surface);
-    return (
-      (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
-      4.5
-    );
-  });
+  return surfaces.some(surface => {
+  const background = luminance(surface);
+  return (Math.max(foreground, background) + 0.05) / (Math.min(foreground, background) + 0.05) >= 4.5;
+});
 }
 export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
killedBy: @s11 does not round a contrast below the required threshold upward
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] BlockStatement
src/appearance-api.ts:42:38
 function validAccent(value: unknown, surfaces: string[]): value is string {
   if (typeof value !== "string" || !/^#[0-9A-F]{6}$/.test(value)) return false;
   const foreground = luminance(value);
-  return surfaces.every((surface) => {
-    const background = luminance(surface);
-    return (
-      (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
-      4.5
-    );
-  });
+  return surfaces.every((surface) => {});
 }
 export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
killedBy: @s41 refreshes imported appearance preserving prior operation (clean)
statusReason: expected '' to be 'light' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/appearance-api.ts:45:7
   return surfaces.every((surface) => {
     const background = luminance(surface);
     return (
-      (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
-      4.5
+      (Math.max(foreground, background) + 0.05) / (Math.min(foreground, background) + 0.05) < 4.5
     );
   });
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:45:7
   return surfaces.every((surface) => {
     const background = luminance(surface);
     return (
-      (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
-      4.5
+      true
     );
   });
killedBy: @s11 does not round a contrast below the required threshold upward
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] ArithmeticOperator
src/appearance-api.ts:46:10
     const background = luminance(surface);
     return (
       (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
+        (Math.min(foreground, background) - 0.05) >=
       4.5
     );
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] MethodExpression
src/appearance-api.ts:46:10
     const background = luminance(surface);
     return (
       (Math.max(foreground, background) + 0.05) /
-        (Math.min(foreground, background) + 0.05) >=
+        (Math.max(foreground, background) + 0.05) >=
       4.5
     );
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] BlockStatement
src/appearance-api.ts:51:76
     );
   });
 }
-export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
-  return validAccent(
-    value.toUpperCase(),
-    theme === "LIGHT" ? lightSurfaces : darkSurfaces,
-  );
-}
+export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {}
 export class AppearanceValidationError extends Error {
   constructor(
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] MethodExpression
src/appearance-api.ts:53:5
 }
 export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
   return validAccent(
-    value.toUpperCase(),
+    value.toLowerCase(),
     theme === "LIGHT" ? lightSurfaces : darkSurfaces,
   );
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance-api.ts:54:5
 export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
   return validAccent(
     value.toUpperCase(),
-    theme === "LIGHT" ? lightSurfaces : darkSurfaces,
+    true ? lightSurfaces : darkSurfaces,
   );
 }
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] EqualityOperator
src/appearance-api.ts:54:5
 export function isAppearanceAccent(value: string, theme: "LIGHT" | "DARK") {
   return validAccent(
     value.toUpperCase(),
-    theme === "LIGHT" ? lightSurfaces : darkSurfaces,
+    theme !== "LIGHT" ? lightSurfaces : darkSurfaces,
   );
 }
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BlockStatement
src/appearance-api.ts:66:32
 }
 export async function readAppearance(
   signal?: AbortSignal,
-): Promise<AppearanceSnapshot> {
-  const response = await apiRequest("/api/v1/me/appearance", {
-    credentials: "same-origin",
-    cache: "no-store",
-    signal,
-  });
-  return snapshot(response, signal);
-}
+): Promise<AppearanceSnapshot> {}
 export async function saveAppearance(
   input: AppearanceInput,
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] ObjectLiteral
src/appearance-api.ts:67:62
 export async function readAppearance(
   signal?: AbortSignal,
 ): Promise<AppearanceSnapshot> {
-  const response = await apiRequest("/api/v1/me/appearance", {
-    credentials: "same-origin",
-    cache: "no-store",
-    signal,
-  });
+  const response = await apiRequest("/api/v1/me/appearance", {});
   return snapshot(response, signal);
 }
killedBy: @s30 invalidates a read started during a write when that write confirms
statusReason: Cannot read properties of undefined (reading 'aborted')

[Killed] ObjectLiteral
src/appearance-api.ts:79:16
   etag: string,
   signal?: AbortSignal,
 ): Promise<AppearanceSnapshot> {
-  const sent = {
-    theme: input.theme,
-    accentLight: input.accentLight,
-    accentDark: input.accentDark,
-  };
+  const sent = {};
   const response = await apiRequest("/api/v1/me/appearance", {
     method: "PUT",
killedBy: @s19 compares confirmation with the captured input despite caller edits during the request
statusReason: promise rejected "Error: Confirmación de apariencia incompa…" instead of resolving

[Killed] StringLiteral
src/appearance-api.ts:84:37
     accentLight: input.accentLight,
     accentDark: input.accentDark,
   };
-  const response = await apiRequest("/api/v1/me/appearance", {
+  const response = await apiRequest("", {
     method: "PUT",
     credentials: "same-origin",
killedBy: @s2 saves exactly three preferences with revision and session CSRF
statusReason: expected '' to be '/api/v1/me/appearance' // Object.is equality

[Killed] StringLiteral
src/appearance-api.ts:85:13
     accentDark: input.accentDark,
   };
   const response = await apiRequest("/api/v1/me/appearance", {
-    method: "PUT",
+    method: "",
     credentials: "same-origin",
     cache: "no-store",
killedBy: @s2 saves exactly three preferences with revision and session CSRF
statusReason: expected { method: '', …(5) } to match object { method: 'PUT', …(3) }
(4 matching properties omitted from actual)

[Killed] StringLiteral
src/appearance-api.ts:86:18
   };
   const response = await apiRequest("/api/v1/me/appearance", {
     method: "PUT",
-    credentials: "same-origin",
+    credentials: "",
     cache: "no-store",
     signal,
killedBy: @s2 saves exactly three preferences with revision and session CSRF
statusReason: expected { Object (method, credentials, ...) } to match object { method: 'PUT', …(3) }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/appearance-api.ts:89:14
     credentials: "same-origin",
     cache: "no-store",
     signal,
-    headers: { "Content-Type": "application/json", "If-Match": etag },
+    headers: {},
     body: JSON.stringify(sent),
   });
killedBy: @s2 saves exactly three preferences with revision and session CSRF
statusReason: expected null to be '"appearance:unconfigured"' // Object.is equality

[Killed] OptionalChaining
src/appearance-api.ts:92:3
     headers: { "Content-Type": "application/json", "If-Match": etag },
     body: JSON.stringify(sent),
   });
-  signal?.throwIfAborted();
+  signal.throwIfAborted();
   if (response.status === 400) {
     const problem: unknown = await response
killedBy: @s27 refinement keeps an untrusted problem as its original response mixed

[Killed] ConditionalExpression
src/appearance-api.ts:93:7
     body: JSON.stringify(sent),
   });
   signal?.throwIfAborted();
-  if (response.status === 400) {
+  if (false) {
     const problem: unknown = await response
       .clone()
killedBy: @s27 refinement preserves a genuine contrast field problem without a signal

[Killed] EqualityOperator
src/appearance-api.ts:93:7
     body: JSON.stringify(sent),
   });
   signal?.throwIfAborted();
-  if (response.status === 400) {
+  if (response.status !== 400) {
     const problem: unknown = await response
       .clone()
killedBy: @s27 refinement keeps an untrusted problem as its original response status

[Survived] ArrowFunction
src/appearance-api.ts:97:14
     const problem: unknown = await response
       .clone()
       .json()
-      .catch(() => null);
+      .catch(() => undefined);
     signal?.throwIfAborted();
     if (

[Killed] OptionalChaining
src/appearance-api.ts:98:5
       .clone()
       .json()
       .catch(() => null);
-    signal?.throwIfAborted();
+    signal.throwIfAborted();
     if (
       exact(problem, "type title status code errors") &&
killedBy: @s27 refinement keeps an untrusted problem as its original response mixed

[Killed] LogicalOperator
src/appearance-api.ts:100:7
       .catch(() => null);
     signal?.throwIfAborted();
     if (
-      exact(problem, "type title status code errors") &&
-      problem.type === "urn:organization:problem:validation_error" &&
-      problem.code === "VALIDATION_ERROR" &&
+      exact(problem, "type title status code errors") && problem.type === "urn:organization:problem:validation_error" || problem.code === "VALIDATION_ERROR" &&
       problem.status === 400 &&
       typeof problem.title === "string" &&
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: contradictory
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  No podemos confirmar el guardado
Received:
  Tema rechazado

[Killed] LogicalOperator
src/appearance-api.ts:100:7
       .catch(() => null);
     signal?.throwIfAborted();
     if (
-      exact(problem, "type title status code errors") &&
-      problem.type === "urn:organization:problem:validation_error" &&
-      problem.code === "VALIDATION_ERROR" &&
-      problem.status === 400 &&
+      exact(problem, "type title status code errors") && problem.type === "urn:organization:problem:validation_error" && problem.code === "VALIDATION_ERROR" || problem.status === 400 &&
       typeof problem.title === "string" &&
       problem.title.trim() &&
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: contradictory
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  No podemos confirmar el guardado
Received:
  Tema rechazado

[Killed] ConditionalExpression
src/appearance-api.ts:101:7
     signal?.throwIfAborted();
     if (
       exact(problem, "type title status code errors") &&
-      problem.type === "urn:organization:problem:validation_error" &&
+      true &&
       problem.code === "VALIDATION_ERROR" &&
       problem.status === 400 &&
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: contradictory
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  No podemos confirmar el guardado
Received:
  Tema rechazado

[Killed] EqualityOperator
src/appearance-api.ts:101:7
     signal?.throwIfAborted();
     if (
       exact(problem, "type title status code errors") &&
-      problem.type === "urn:organization:problem:validation_error" &&
+      problem.type !== "urn:organization:problem:validation_error" &&
       problem.code === "VALIDATION_ERROR" &&
       problem.status === 400 &&
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Killed] EqualityOperator
src/appearance-api.ts:102:7
     if (
       exact(problem, "type title status code errors") &&
       problem.type === "urn:organization:problem:validation_error" &&
-      problem.code === "VALIDATION_ERROR" &&
+      problem.code !== "VALIDATION_ERROR" &&
       problem.status === 400 &&
       typeof problem.title === "string" &&
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Survived] ConditionalExpression
src/appearance-api.ts:102:7
     if (
       exact(problem, "type title status code errors") &&
       problem.type === "urn:organization:problem:validation_error" &&
-      problem.code === "VALIDATION_ERROR" &&
+      true &&
       problem.status === 400 &&
       typeof problem.title === "string" &&

[Killed] EqualityOperator
src/appearance-api.ts:103:7
       exact(problem, "type title status code errors") &&
       problem.type === "urn:organization:problem:validation_error" &&
       problem.code === "VALIDATION_ERROR" &&
-      problem.status === 400 &&
+      problem.status !== 400 &&
       typeof problem.title === "string" &&
       problem.title.trim() &&
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Survived] ConditionalExpression
src/appearance-api.ts:103:7
       exact(problem, "type title status code errors") &&
       problem.type === "urn:organization:problem:validation_error" &&
       problem.code === "VALIDATION_ERROR" &&
-      problem.status === 400 &&
+      true &&
       typeof problem.title === "string" &&
       problem.title.trim() &&

[Killed] EqualityOperator
src/appearance-api.ts:104:7
       problem.type === "urn:organization:problem:validation_error" &&
       problem.code === "VALIDATION_ERROR" &&
       problem.status === 400 &&
-      typeof problem.title === "string" &&
+      typeof problem.title !== "string" &&
       problem.title.trim() &&
       Array.isArray(problem.errors) &&
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Survived] ConditionalExpression
src/appearance-api.ts:104:7
       problem.type === "urn:organization:problem:validation_error" &&
       problem.code === "VALIDATION_ERROR" &&
       problem.status === 400 &&
-      typeof problem.title === "string" &&
+      true &&
       problem.title.trim() &&
       Array.isArray(problem.errors) &&

[Survived] MethodExpression
src/appearance-api.ts:105:7
       problem.code === "VALIDATION_ERROR" &&
       problem.status === 400 &&
       typeof problem.title === "string" &&
-      problem.title.trim() &&
+      problem.title &&
       Array.isArray(problem.errors) &&
       problem.errors.length > 0 &&

[Killed] EqualityOperator
src/appearance-api.ts:107:7
       typeof problem.title === "string" &&
       problem.title.trim() &&
       Array.isArray(problem.errors) &&
-      problem.errors.length > 0 &&
+      problem.errors.length <= 0 &&
       problem.errors.every(
         (entry) =>
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Survived] ConditionalExpression
src/appearance-api.ts:107:7
       typeof problem.title === "string" &&
       problem.title.trim() &&
       Array.isArray(problem.errors) &&
-      problem.errors.length > 0 &&
+      true &&
       problem.errors.every(
         (entry) =>

[Killed] ArrowFunction
src/appearance-api.ts:109:9
       Array.isArray(problem.errors) &&
       problem.errors.length > 0 &&
       problem.errors.every(
-        (entry) =>
-          exact(entry, "field code message") &&
-          ["theme", "accentLight", "accentDark"].includes(
-            entry.field as string,
-          ) &&
-          [
-            "REQUIRED",
-            "INVALID_TYPE",
-            "INVALID_VALUE",
-            "INSUFFICIENT_CONTRAST",
-          ].includes(entry.code as string) &&
-          typeof entry.message === "string" &&
-          entry.message.trim(),
+        () => undefined,
       )
     ) {
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Killed] ConditionalExpression
src/appearance-api.ts:110:11
       problem.errors.length > 0 &&
       problem.errors.every(
         (entry) =>
-          exact(entry, "field code message") &&
-          ["theme", "accentLight", "accentDark"].includes(
-            entry.field as string,
-          ) &&
-          [
-            "REQUIRED",
-            "INVALID_TYPE",
-            "INVALID_VALUE",
-            "INSUFFICIENT_CONTRAST",
-          ].includes(entry.code as string) &&
-          typeof entry.message === "string" &&
-          entry.message.trim(),
+          true,
       )
     ) {
killedBy: @s27 refinement keeps an untrusted problem as its original response mixed
