[Killed] ConditionalExpression
src/use-session.ts:209:7
   };
 }
 function isPrivateRoute(path: string, search: string) {
-  if (path === "/proyectos") {
+  if (true) {
     const query = new URLSearchParams(search);
     return (
killedBy: @s47 login no acepta una variante de la ruta exacta: /disponibilidad-extra
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] EqualityOperator
src/use-session.ts:209:7
   };
 }
 function isPrivateRoute(path: string, search: string) {
-  if (path === "/proyectos") {
+  if (path !== "/proyectos") {
     const query = new URLSearchParams(search);
     return (
killedBy: @s16 descarta retorno ajeno al recorrido /proyectos-maliciosos
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] ConditionalExpression
src/use-session.ts:212:7
   if (path === "/proyectos") {
     const query = new URLSearchParams(search);
     return (
-      !search ||
-      (query.size === 1 && query.has("cursor") && Boolean(query.get("cursor")))
+      false
     );
   }
killedBy: @s16 conserva la ruta propia tras login /proyectos
statusReason: expected '/' to be '/proyectos' // Object.is equality

[Killed] ConditionalExpression
src/use-session.ts:212:7
   if (path === "/proyectos") {
     const query = new URLSearchParams(search);
     return (
-      !search ||
-      (query.size === 1 && query.has("cursor") && Boolean(query.get("cursor")))
+      true
     );
   }
killedBy: @s16 login descarta rutas parcialmente válidas /proyectos?cursor=
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] EqualityOperator
src/use-session.ts:213:8
     const query = new URLSearchParams(search);
     return (
       !search ||
-      (query.size === 1 && query.has("cursor") && Boolean(query.get("cursor")))
+      (query.size !== 1 && query.has("cursor") && Boolean(query.get("cursor")))
     );
   }
killedBy: @s16 conserva la ruta propia tras login /proyectos?cursor=opaque%2Btoken
statusReason: expected '/' to be '/proyectos?cursor=opaque%2Btoken' // Object.is equality

[Killed] LogicalOperator
src/use-session.ts:213:8
     const query = new URLSearchParams(search);
     return (
       !search ||
-      (query.size === 1 && query.has("cursor") && Boolean(query.get("cursor")))
+      (query.size === 1 && query.has("cursor") || Boolean(query.get("cursor")))
     );
   }
killedBy: @s16 login descarta rutas parcialmente válidas /proyectos?cursor=
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] BooleanLiteral
src/use-session.ts:217:5
     );
   }
   return (
-    !search &&
+    search &&
     (path === "/" ||
       path === "/disponibilidad" ||
killedBy: @s33 import23 preserves its direct route after authentication without requesting an import
statusReason: Unable to find role="heading" and name "Importar mis datos"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] ConditionalExpression
src/use-session.ts:218:6
   }
   return (
     !search &&
-    (path === "/" ||
-      path === "/disponibilidad" ||
-      path === "/apariencia" ||
-      path === "/exportacion" ||
-      path === "/importacion" ||
-      path === "/integraciones/api" ||
-      path === "/proyectos/nuevo" ||
+    (false ||
         path,
killedBy: @s33 import23 preserves its direct route after authentication without requesting an import
statusReason: Unable to find role="heading" and name "Importar mis datos"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] ConditionalExpression
src/use-session.ts:218:6
   }
   return (
     !search &&
-    (path === "/" ||
-      path === "/disponibilidad" ||
-      path === "/apariencia" ||
-      path === "/exportacion" ||
-      path === "/importacion" ||
-      path === "/integraciones/api" ||
+    (false ||
       path === "/proyectos/nuevo" ||
killedBy: @s33 import23 preserves its direct route after authentication without requesting an import
statusReason: Unable to find role="heading" and name "Importar mis datos"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] EqualityOperator
src/use-session.ts:219:7
   return (
     !search &&
     (path === "/" ||
-      path === "/disponibilidad" ||
+      path !== "/disponibilidad" ||
       path === "/apariencia" ||
       path === "/exportacion" ||
killedBy: @s47 login no acepta una variante de la ruta exacta: /disponibilidad-extra
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] ConditionalExpression
src/use-session.ts:219:7
   return (
     !search &&
     (path === "/" ||
-      path === "/disponibilidad" ||
+      false ||
       path === "/apariencia" ||
       path === "/exportacion" ||
killedBy: @s47 vuelve a la ruta exacta después de iniciar sesión
statusReason: Unable to find role="heading" and name "Disponibilidad"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] EqualityOperator
src/use-session.ts:220:7
     !search &&
     (path === "/" ||
       path === "/disponibilidad" ||
-      path === "/apariencia" ||
+      path !== "/apariencia" ||
       path === "/exportacion" ||
       path === "/importacion" ||
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: Unable to find role="radio" and name "Claro"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] ConditionalExpression
src/use-session.ts:220:7
     !search &&
     (path === "/" ||
       path === "/disponibilidad" ||
-      path === "/apariencia" ||
+      false ||
       path === "/exportacion" ||
       path === "/importacion" ||
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: Unable to find role="radio" and name "Claro"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] EqualityOperator
src/use-session.ts:221:7
     (path === "/" ||
       path === "/disponibilidad" ||
       path === "/apariencia" ||
-      path === "/exportacion" ||
+      path !== "/exportacion" ||
       path === "/importacion" ||
       path === "/integraciones/api" ||
killedBy: @s47 login no acepta una variante de la ruta exacta: /disponibilidad-extra
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] ConditionalExpression
src/use-session.ts:221:7
     (path === "/" ||
       path === "/disponibilidad" ||
       path === "/apariencia" ||
-      path === "/exportacion" ||
+      false ||
       path === "/importacion" ||
       path === "/integraciones/api" ||
killedBy: @s29 keeps Bruno's session when Ana's cancelled export returns a late 401 after logout
statusReason: Unable to find an element with the text: /datos de bruno/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] EqualityOperator
src/use-session.ts:222:7
       path === "/disponibilidad" ||
       path === "/apariencia" ||
       path === "/exportacion" ||
-      path === "/importacion" ||
+      path !== "/importacion" ||
       path === "/integraciones/api" ||
       path === "/proyectos/nuevo" ||
killedBy: @s47 login no acepta una variante de la ruta exacta: /disponibilidad-extra
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] ConditionalExpression
src/use-session.ts:222:7
       path === "/disponibilidad" ||
       path === "/apariencia" ||
       path === "/exportacion" ||
-      path === "/importacion" ||
+      false ||
       path === "/integraciones/api" ||
       path === "/proyectos/nuevo" ||
killedBy: @s33 import23 preserves its direct route after authentication without requesting an import
statusReason: Unable to find role="heading" and name "Importar mis datos"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] EqualityOperator
src/use-session.ts:223:7
       path === "/apariencia" ||
       path === "/exportacion" ||
       path === "/importacion" ||
-      path === "/integraciones/api" ||
+      path !== "/integraciones/api" ||
       path === "/proyectos/nuevo" ||
killedBy: @s47 login no acepta una variante de la ruta exacta: /disponibilidad-extra
statusReason: Unable to find role="heading" and name "Hoy"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] ConditionalExpression
src/use-session.ts:223:7
       path === "/apariencia" ||
       path === "/exportacion" ||
       path === "/importacion" ||
-      path === "/integraciones/api" ||
+      false ||
       path === "/proyectos/nuevo" ||
killedBy: @s41 a direct private route survives real login and adds one final navigation link
statusReason: Unable to find role="heading" and name "Credenciales para integraciones"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] EqualityOperator
src/use-session.ts:224:7
       path === "/exportacion" ||
       path === "/importacion" ||
       path === "/integraciones/api" ||
-      path === "/proyectos/nuevo" ||
+      path !== "/proyectos/nuevo" ||
         path,
killedBy: @s2 confirma la sesión después de enviar formulario con CSRF
statusReason: Unable to find a label with the text of: /Nombre del proyecto/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] ConditionalExpression
src/use-session.ts:224:7
       path === "/exportacion" ||
       path === "/importacion" ||
       path === "/integraciones/api" ||
-      path === "/proyectos/nuevo" ||
+      false ||
         path,
killedBy: @s2 confirma la sesión después de enviar formulario con CSRF
statusReason: Unable to find a label with the text of: /Nombre del proyecto/

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""
