[Killed] ConditionalExpression
src/appearance-api.ts:110:11
       problem.errors.length > 0 &&
       problem.errors.every(
         (entry) =>
-          exact(entry, "field code message") &&
-          ["theme", "accentLight", "accentDark"].includes(
-            entry.field as string,
-          ) &&
-          [
-            "REQUIRED",
-            "INVALID_TYPE",
-            "INVALID_VALUE",
-            "INSUFFICIENT_CONTRAST",
-          ].includes(entry.code as string) &&
+          true &&
           typeof entry.message === "string" &&
           entry.message.trim(),
killedBy: @s27 refinement keeps an untrusted problem as its original response mixed

[Killed] StringLiteral
src/appearance-api.ts:111:36
       problem.errors.every(
         (entry) =>
           exact(entry, "field code message") &&
-          ["theme", "accentLight", "accentDark"].includes(
+          ["theme", "accentLight", ""].includes(
             entry.field as string,
           ) &&
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Killed] StringLiteral
src/appearance-api.ts:111:21
       problem.errors.every(
         (entry) =>
           exact(entry, "field code message") &&
-          ["theme", "accentLight", "accentDark"].includes(
+          ["theme", "", "accentDark"].includes(
             entry.field as string,
           ) &&
killedBy: @s27 refinement preserves a genuine contrast field problem without a signal

[Killed] ArrayDeclaration
src/appearance-api.ts:114:11
           ["theme", "accentLight", "accentDark"].includes(
             entry.field as string,
           ) &&
-          [
-            "REQUIRED",
-            "INVALID_TYPE",
-            "INVALID_VALUE",
-            "INSUFFICIENT_CONTRAST",
-          ].includes(entry.code as string) &&
+          [].includes(entry.code as string) &&
           typeof entry.message === "string" &&
           entry.message.trim(),
killedBy: @s27 refinement preserves a genuine contrast field problem without a signal

[Survived] StringLiteral
src/appearance-api.ts:116:13
           ) &&
           [
             "REQUIRED",
-            "INVALID_TYPE",
+            "",
             "INVALID_VALUE",
             "INSUFFICIENT_CONTRAST",

[Killed] StringLiteral
src/appearance-api.ts:118:13
             "REQUIRED",
             "INVALID_TYPE",
             "INVALID_VALUE",
-            "INSUFFICIENT_CONTRAST",
+            "",
           ].includes(entry.code as string) &&
           typeof entry.message === "string" &&
killedBy: @s27 refinement preserves a genuine contrast field problem without a signal

[Killed] EqualityOperator
src/appearance-api.ts:120:11
             "INVALID_VALUE",
             "INSUFFICIENT_CONTRAST",
           ].includes(entry.code as string) &&
-          typeof entry.message === "string" &&
+          typeof entry.message !== "string" &&
           entry.message.trim(),
       )
killedBy: @s27 refinement preserves a genuine contrast field problem without a signal

[Survived] ConditionalExpression
src/appearance-api.ts:120:11
             "INVALID_VALUE",
             "INSUFFICIENT_CONTRAST",
           ].includes(entry.code as string) &&
-          typeof entry.message === "string" &&
+          true &&
           entry.message.trim(),
       )

[Survived] MethodExpression
src/appearance-api.ts:121:11
             "INSUFFICIENT_CONTRAST",
           ].includes(entry.code as string) &&
           typeof entry.message === "string" &&
-          entry.message.trim(),
+          entry.message,
       )
     ) {

[Killed] BlockStatement
src/appearance-api.ts:123:7
           typeof entry.message === "string" &&
           entry.message.trim(),
       )
-    ) {
-      throw new AppearanceValidationError(
-        Object.fromEntries(
-          problem.errors.map((entry) => [entry.field, entry.message]),
-        ),
-      );
-    }
+    ) {}
   }
   const next = await snapshot(response, signal);
killedBy: @s27 refinement preserves a genuine contrast field problem without a signal

[Killed] ArrowFunction
src/appearance-api.ts:126:30
     ) {
       throw new AppearanceValidationError(
         Object.fromEntries(
-          problem.errors.map((entry) => [entry.field, entry.message]),
+          problem.errors.map(() => undefined),
         ),
       );
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p> ] to have a length of 3 but got 1

[Killed] OptionalChaining
src/appearance-api.ts:132:3
     }
   }
   const next = await snapshot(response, signal);
-  signal?.throwIfAborted();
+  signal.throwIfAborted();
   if (
     !next.configured ||
killedBy: @s28 refuses an absent resource as a successful PUT confirmation
statusReason: expected [Function] to throw error including 'Confirmación de apariencia incompatib…' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/appearance-api.ts:134:5
   const next = await snapshot(response, signal);
   signal?.throwIfAborted();
   if (
-    !next.configured ||
-    next.theme !== sent.theme ||
-    next.accentLight !== sent.accentLight.toUpperCase() ||
-    next.accentDark !== sent.accentDark.toUpperCase()
+    true
   )
     throw new Error("Confirmación de apariencia incompatible");
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] LogicalOperator
src/appearance-api.ts:134:5
   const next = await snapshot(response, signal);
   signal?.throwIfAborted();
   if (
-    !next.configured ||
-    next.theme !== sent.theme ||
+    !next.configured && next.theme !== sent.theme ||
     next.accentLight !== sent.accentLight.toUpperCase() ||
     next.accentDark !== sent.accentDark.toUpperCase()
killedBy: @s28 refuses an absent resource as a successful PUT confirmation
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:135:5
   signal?.throwIfAborted();
   if (
     !next.configured ||
-    next.theme !== sent.theme ||
+    false ||
     next.accentLight !== sent.accentLight.toUpperCase() ||
     next.accentDark !== sent.accentDark.toUpperCase()
killedBy: @s19 rejects a valid confirmation for a different theme intention
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] EqualityOperator
src/appearance-api.ts:135:5
   signal?.throwIfAborted();
   if (
     !next.configured ||
-    next.theme !== sent.theme ||
+    next.theme === sent.theme ||
     next.accentLight !== sent.accentLight.toUpperCase() ||
     next.accentDark !== sent.accentDark.toUpperCase()
killedBy: @s19 compares confirmation with the captured input despite caller edits during the request
statusReason: promise rejected "Error: Confirmación de apariencia incompa…" instead of resolving

[Killed] EqualityOperator
src/appearance-api.ts:136:5
   if (
     !next.configured ||
     next.theme !== sent.theme ||
-    next.accentLight !== sent.accentLight.toUpperCase() ||
+    next.accentLight === sent.accentLight.toUpperCase() ||
     next.accentDark !== sent.accentDark.toUpperCase()
   )
killedBy: @s19 compares confirmation with the captured input despite caller edits during the request
statusReason: promise rejected "Error: Confirmación de apariencia incompa…" instead of resolving

[Killed] MethodExpression
src/appearance-api.ts:136:26
   if (
     !next.configured ||
     next.theme !== sent.theme ||
-    next.accentLight !== sent.accentLight.toUpperCase() ||
+    next.accentLight !== sent.accentLight.toLowerCase() ||
     next.accentDark !== sent.accentDark.toUpperCase()
   )
killedBy: @s19 compares confirmation with the captured input despite caller edits during the request
statusReason: promise rejected "Error: Confirmación de apariencia incompa…" instead of resolving

[Killed] EqualityOperator
src/appearance-api.ts:137:5
     !next.configured ||
     next.theme !== sent.theme ||
     next.accentLight !== sent.accentLight.toUpperCase() ||
-    next.accentDark !== sent.accentDark.toUpperCase()
+    next.accentDark === sent.accentDark.toUpperCase()
   )
     throw new Error("Confirmación de apariencia incompatible");
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance-api.ts:137:5
     !next.configured ||
     next.theme !== sent.theme ||
     next.accentLight !== sent.accentLight.toUpperCase() ||
-    next.accentDark !== sent.accentDark.toUpperCase()
+    false
   )
     throw new Error("Confirmación de apariencia incompatible");
killedBy: @s19 rejects a valid confirmation for a different dark accent
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] OptionalChaining
src/appearance-api.ts:146:3
   response: Response,
   signal?: AbortSignal,
 ): Promise<AppearanceSnapshot> {
-  signal?.throwIfAborted();
+  signal.throwIfAborted();
   if (response.status !== 200) throw response;
   const data: unknown = await response.json();
killedBy: @s27 refinement keeps an untrusted problem as its original response mixed

[Killed] ConditionalExpression
src/appearance-api.ts:147:7
   signal?: AbortSignal,
 ): Promise<AppearanceSnapshot> {
   signal?.throwIfAborted();
-  if (response.status !== 200) throw response;
+  if (true) throw response;
   const data: unknown = await response.json();
   signal?.throwIfAborted();
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel

[Killed] ConditionalExpression
src/appearance-api.ts:147:7
   signal?: AbortSignal,
 ): Promise<AppearanceSnapshot> {
   signal?.throwIfAborted();
-  if (response.status !== 200) throw response;
+  if (false) throw response;
   const data: unknown = await response.json();
   signal?.throwIfAborted();
killedBy: @s27 refinement keeps an untrusted problem as its original response mixed

[Killed] OptionalChaining
src/appearance-api.ts:149:3
   signal?.throwIfAborted();
   if (response.status !== 200) throw response;
   const data: unknown = await response.json();
-  signal?.throwIfAborted();
+  signal.throwIfAborted();
   if (
     !exact(data, "configured theme accentLight accentDark updatedAt") ||
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:151:5
   const data: unknown = await response.json();
   signal?.throwIfAborted();
   if (
-    !exact(data, "configured theme accentLight accentDark updatedAt") ||
-    typeof data.configured !== "boolean"
+    true
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="appearance-load-error"
    >

[Killed] LogicalOperator
src/appearance-api.ts:151:5
   const data: unknown = await response.json();
   signal?.throwIfAborted();
   if (
-    !exact(data, "configured theme accentLight accentDark updatedAt") ||
-    typeof data.configured !== "boolean"
+    !exact(data, "configured theme accentLight accentDark updatedAt") && typeof data.configured !== "boolean"
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s18 rejects a string configured flag
statusReason: promise resolved "{ configured: 'true', …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:152:5
   signal?.throwIfAborted();
   if (
     !exact(data, "configured theme accentLight accentDark updatedAt") ||
-    typeof data.configured !== "boolean"
+    false
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s18 rejects a string configured flag
statusReason: promise resolved "{ configured: 'true', …(5) }" instead of rejecting

[Killed] EqualityOperator
src/appearance-api.ts:152:5
   signal?.throwIfAborted();
   if (
     !exact(data, "configured theme accentLight accentDark updatedAt") ||
-    typeof data.configured !== "boolean"
+    typeof data.configured === "boolean"
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] EqualityOperator
src/appearance-api.ts:156:5
   )
     throw new Error("Respuesta de apariencia inválida");
   if (
-    data.configured === false &&
+    data.configured !== false &&
     (data.theme !== "SYSTEM" ||
       data.accentLight !== "#244C3C" ||
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:156:5
   )
     throw new Error("Respuesta de apariencia inválida");
   if (
-    data.configured === false &&
-    (data.theme !== "SYSTEM" ||
-      data.accentLight !== "#244C3C" ||
-      data.accentDark !== "#B7E4C7" ||
-      data.updatedAt !== null ||
-      response.headers.get("ETag") !== '"appearance:unconfigured"')
+    true
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] LogicalOperator
src/appearance-api.ts:157:6
     throw new Error("Respuesta de apariencia inválida");
   if (
     data.configured === false &&
-    (data.theme !== "SYSTEM" ||
-      data.accentLight !== "#244C3C" ||
+    (data.theme !== "SYSTEM" && data.accentLight !== "#244C3C" ||
       data.accentDark !== "#B7E4C7" ||
       data.updatedAt !== null ||
killedBy: @s18 refinement rejects incompatible unconfigured light
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] LogicalOperator
src/appearance-api.ts:157:6
     throw new Error("Respuesta de apariencia inválida");
   if (
     data.configured === false &&
-    (data.theme !== "SYSTEM" ||
-      data.accentLight !== "#244C3C" ||
-      data.accentDark !== "#B7E4C7" ||
-      data.updatedAt !== null ||
+    ((data.theme !== "SYSTEM" || data.accentLight !== "#244C3C" || data.accentDark !== "#B7E4C7") && data.updatedAt !== null ||
       response.headers.get("ETag") !== '"appearance:unconfigured"')
   )
killedBy: @s18 refinement rejects incompatible unconfigured light
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:158:7
   if (
     data.configured === false &&
     (data.theme !== "SYSTEM" ||
-      data.accentLight !== "#244C3C" ||
+      false ||
       data.accentDark !== "#B7E4C7" ||
       data.updatedAt !== null ||
killedBy: @s18 refinement rejects incompatible unconfigured light
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] EqualityOperator
src/appearance-api.ts:158:7
   if (
     data.configured === false &&
     (data.theme !== "SYSTEM" ||
-      data.accentLight !== "#244C3C" ||
+      data.accentLight === "#244C3C" ||
       data.accentDark !== "#B7E4C7" ||
       data.updatedAt !== null ||
killedBy: @s18 refinement rejects incompatible unconfigured light
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:159:7
     data.configured === false &&
     (data.theme !== "SYSTEM" ||
       data.accentLight !== "#244C3C" ||
-      data.accentDark !== "#B7E4C7" ||
+      false ||
       data.updatedAt !== null ||
       response.headers.get("ETag") !== '"appearance:unconfigured"')
killedBy: @s18 refinement rejects incompatible unconfigured dark
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] EqualityOperator
src/appearance-api.ts:159:7
     data.configured === false &&
     (data.theme !== "SYSTEM" ||
       data.accentLight !== "#244C3C" ||
-      data.accentDark !== "#B7E4C7" ||
+      data.accentDark === "#B7E4C7" ||
       data.updatedAt !== null ||
       response.headers.get("ETag") !== '"appearance:unconfigured"')
killedBy: @s18 refinement rejects incompatible unconfigured dark
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:160:7
     (data.theme !== "SYSTEM" ||
       data.accentLight !== "#244C3C" ||
       data.accentDark !== "#B7E4C7" ||
-      data.updatedAt !== null ||
+      false ||
       response.headers.get("ETag") !== '"appearance:unconfigured"')
   )
killedBy: @s18 rejects an unconfigured snapshot timestamp
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] EqualityOperator
src/appearance-api.ts:160:7
     (data.theme !== "SYSTEM" ||
       data.accentLight !== "#244C3C" ||
       data.accentDark !== "#B7E4C7" ||
-      data.updatedAt !== null ||
+      data.updatedAt === null ||
       response.headers.get("ETag") !== '"appearance:unconfigured"')
   )
killedBy: @s28 refuses an absent resource as a successful PUT confirmation
statusReason: expected [Function] to throw error including 'Confirmación de apariencia incompatib…' but got 'Respuesta de apariencia inválida'

[Killed] EqualityOperator
src/appearance-api.ts:161:7
       data.accentLight !== "#244C3C" ||
       data.accentDark !== "#B7E4C7" ||
       data.updatedAt !== null ||
-      response.headers.get("ETag") !== '"appearance:unconfigured"')
+      response.headers.get("ETag") === '"appearance:unconfigured"')
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s18 refinement rejects incompatible unconfigured etag
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:161:7
       data.accentLight !== "#244C3C" ||
       data.accentDark !== "#B7E4C7" ||
       data.updatedAt !== null ||
-      response.headers.get("ETag") !== '"appearance:unconfigured"')
+      false)
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s18 refinement rejects incompatible unconfigured etag
statusReason: promise resolved "{ configured: false, …(5) }" instead of rejecting

[Killed] StringLiteral
src/appearance-api.ts:163:21
       data.updatedAt !== null ||
       response.headers.get("ETag") !== '"appearance:unconfigured"')
   )
-    throw new Error("Respuesta de apariencia inválida");
+    throw new Error("");
   if (
     data.theme !== "LIGHT" &&
killedBy: @s18 refinement rejects incompatible unconfigured light
statusReason: expected [Function] to throw error including 'Respuesta de apariencia inválida' but got ''

[Killed] LogicalOperator
src/appearance-api.ts:165:5
   )
     throw new Error("Respuesta de apariencia inválida");
   if (
-    data.theme !== "LIGHT" &&
-    data.theme !== "DARK" &&
-    data.theme !== "SYSTEM"
+    data.theme !== "LIGHT" && data.theme !== "DARK" || data.theme !== "SYSTEM"
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:165:5
   )
     throw new Error("Respuesta de apariencia inválida");
   if (
-    data.theme !== "LIGHT" &&
-    data.theme !== "DARK" &&
-    data.theme !== "SYSTEM"
+    true
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:166:5
     throw new Error("Respuesta de apariencia inválida");
   if (
     data.theme !== "LIGHT" &&
-    data.theme !== "DARK" &&
+    true &&
     data.theme !== "SYSTEM"
   )
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] EqualityOperator
src/appearance-api.ts:166:5
     throw new Error("Respuesta de apariencia inválida");
   if (
     data.theme !== "LIGHT" &&
-    data.theme !== "DARK" &&
+    data.theme === "DARK" &&
     data.theme !== "SYSTEM"
   )
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:167:5
   if (
     data.theme !== "LIGHT" &&
     data.theme !== "DARK" &&
-    data.theme !== "SYSTEM"
+    true
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s28 refuses an absent resource as a successful PUT confirmation
statusReason: expected [Function] to throw error including 'Confirmación de apariencia incompatib…' but got 'Respuesta de apariencia inválida'

[Killed] EqualityOperator
src/appearance-api.ts:167:5
   if (
     data.theme !== "LIGHT" &&
     data.theme !== "DARK" &&
-    data.theme !== "SYSTEM"
+    data.theme === "SYSTEM"
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s28 refuses an absent resource as a successful PUT confirmation
statusReason: expected [Function] to throw error including 'Confirmación de apariencia incompatib…' but got 'Respuesta de apariencia inválida'

[Killed] ConditionalExpression
src/appearance-api.ts:170:7
     data.theme !== "SYSTEM"
   )
     throw new Error("Respuesta de apariencia inválida");
-  if (data.configured && !instant(data.updatedAt))
+  if (false)
     throw new Error("Respuesta de apariencia inválida");
   if (
killedBy: @s18 rejects a configured snapshot without its timestamp
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:170:7
     data.theme !== "SYSTEM"
   )
     throw new Error("Respuesta de apariencia inválida");
-  if (data.configured && !instant(data.updatedAt))
+  if (true)
     throw new Error("Respuesta de apariencia inválida");
   if (
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:173:5
   if (data.configured && !instant(data.updatedAt))
     throw new Error("Respuesta de apariencia inválida");
   if (
-    !validAccent(data.accentLight, lightSurfaces) ||
-    !validAccent(data.accentDark, darkSurfaces)
+    true
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:173:5
   if (data.configured && !instant(data.updatedAt))
     throw new Error("Respuesta de apariencia inválida");
   if (
-    !validAccent(data.accentLight, lightSurfaces) ||
-    !validAccent(data.accentDark, darkSurfaces)
+    false
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s18 refinement rejects a noncanonical HEX #0000FFsuffix
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] BooleanLiteral
src/appearance-api.ts:174:5
     throw new Error("Respuesta de apariencia inválida");
   if (
     !validAccent(data.accentLight, lightSurfaces) ||
-    !validAccent(data.accentDark, darkSurfaces)
+    validAccent(data.accentDark, darkSurfaces)
   )
     throw new Error("Respuesta de apariencia inválida");
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] BlockStatement
src/appearance-api.ts:178:24
   )
     throw new Error("Respuesta de apariencia inválida");
   const etag = response.headers.get("ETag");
-  if (data.configured) {
-    const match = etag?.match(
-      /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
-    );
-    if (!match || BigInt(match[1]) > 9223372036854775807n)
-      throw new Error("Respuesta de apariencia inválida");
-  }
+  if (data.configured) {}
   return { ...data, etag } as AppearanceSnapshot;
 }
killedBy: @s18 refinement rejects a configured revision with a trailing token
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/appearance-api.ts:178:7
   )
     throw new Error("Respuesta de apariencia inválida");
   const etag = response.headers.get("ETag");
-  if (data.configured) {
+  if (true) {
     const match = etag?.match(
       /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
killedBy: @s28 refuses an absent resource as a successful PUT confirmation
statusReason: expected [Function] to throw error including 'Confirmación de apariencia incompatib…' but got 'Respuesta de apariencia inválida'

[Survived] OptionalChaining
src/appearance-api.ts:179:19
     throw new Error("Respuesta de apariencia inválida");
   const etag = response.headers.get("ETag");
   if (data.configured) {
-    const match = etag?.match(
+    const match = etag.match(
       /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
     );

[Killed] Regex
src/appearance-api.ts:180:7
   const etag = response.headers.get("ETag");
   if (data.configured) {
     const match = etag?.match(
-      /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
+      /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
     );
     if (!match || BigInt(match[1]) > 9223372036854775807n)
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] Regex
src/appearance-api.ts:180:7
   const etag = response.headers.get("ETag");
   if (data.configured) {
     const match = etag?.match(
-      /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
+      /^"appearance:[0-9a-f]{8}-[0-9a-f]-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
     );
     if (!match || BigInt(match[1]) > 9223372036854775807n)
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving

[Killed] ConditionalExpression
src/appearance-api.ts:182:19
     const match = etag?.match(
       /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
     );
-    if (!match || BigInt(match[1]) > 9223372036854775807n)
+    if (!match || false)
       throw new Error("Respuesta de apariencia inválida");
   }
killedBy: @s18 rejects a configured revision beyond BIGINT before applying it
statusReason: promise resolved "{ configured: true, …(5) }" instead of rejecting

[Killed] EqualityOperator
src/appearance-api.ts:182:19
     const match = etag?.match(
       /^"appearance:[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}:(0|[1-9][0-9]{0,18})"$/,
     );
-    if (!match || BigInt(match[1]) > 9223372036854775807n)
+    if (!match || BigInt(match[1]) >= 9223372036854775807n)
       throw new Error("Respuesta de apariencia inválida");
   }
killedBy: @s11 refinement accepts a valid accent with a low nonzero channel
statusReason: promise rejected "Error: Respuesta de apariencia inválida" instead of resolving
