[Killed] BlockStatement
src/appearance.tsx:17:30
   type AppearanceSnapshot,
 } from "./appearance-api";
 
-export function Appearance() {
-  const { snapshot, failed } = useAppearance();
-  const heading = useRef<HTMLHeadingElement>(null);
-  useLayoutEffect(() => {
-    heading.current?.focus();
-  }, []);
-  return (
-    <main className="appearance" id="proyectos">
-      <h1 ref={heading} tabIndex={-1}>
-        Apariencia
-      </h1>
-      {!snapshot && !failed && <p role="status">Consultando apariencia…</p>}
-      {failed && snapshot && (
-        <>
-          <p role="alert">
-            No se pudo consultar la apariencia. Se conserva la última versión
-            confirmada.
-          </p>
-        </>
-      )}
-      {snapshot && <AppearanceForm snapshot={snapshot} heading={heading} />}
-    </main>
-  );
-}
+export function Appearance() {}
 function AppearanceForm({
   snapshot,
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/appearance.tsx:20:25
 export function Appearance() {
   const { snapshot, failed } = useAppearance();
   const heading = useRef<HTMLHeadingElement>(null);
-  useLayoutEffect(() => {
-    heading.current?.focus();
-  }, []);
+  useLayoutEffect(() => {}, []);
   return (
     <main className="appearance" id="proyectos">
killedBy: @s20 opens appearance through the principal navigation at its stable route
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Apariencia
</h1>

[Killed] OptionalChaining
src/appearance.tsx:21:5
   const { snapshot, failed } = useAppearance();
   const heading = useRef<HTMLHeadingElement>(null);
   useLayoutEffect(() => {
-    heading.current?.focus();
+    heading.current.focus();
   }, []);
   return (
killedBy: @s24 follows a system color-scheme change without persisting another preference
statusReason: expected '' to be 'dark' // Object.is equality

[Survived] UnaryOperator
src/appearance.tsx:25:35
   }, []);
   return (
     <main className="appearance" id="proyectos">
-      <h1 ref={heading} tabIndex={-1}>
+      <h1 ref={heading} tabIndex={+1}>
         Apariencia
       </h1>

[Killed] ConditionalExpression
src/appearance.tsx:28:8
       <h1 ref={heading} tabIndex={-1}>
         Apariencia
       </h1>
-      {!snapshot && !failed && <p role="status">Consultando apariencia…</p>}
+      {true}
       {failed && snapshot && (
         <>
killedBy: @s31 ignores Ana's late 'GET' HTTP 401 (deferred JSON false) after logout and Bruno's appearance has loaded
statusReason: Unable to find an element with the text: Consultando apariencia…. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="access-recovery"
      hidden=""

[Killed] ConditionalExpression
src/appearance.tsx:28:8
       <h1 ref={heading} tabIndex={-1}>
         Apariencia
       </h1>
-      {!snapshot && !failed && <p role="status">Consultando apariencia…</p>}
+      {true && <p role="status">Consultando apariencia…</p>}
       {failed && snapshot && (
         <>
killedBy: @s20 loads the own appearance through the application's StrictMode lifecycle
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  role="status"
>
  Consultando apariencia…
</p> instead

[Killed] LogicalOperator
src/appearance.tsx:29:8
         Apariencia
       </h1>
       {!snapshot && !failed && <p role="status">Consultando apariencia…</p>}
-      {failed && snapshot && (
+      {failed || snapshot && (
         <>
           <p role="alert">
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p>, …(3) ] to have a length of 3 but got 4

[Killed] ConditionalExpression
src/appearance.tsx:29:8
         Apariencia
       </h1>
       {!snapshot && !failed && <p role="status">Consultando apariencia…</p>}
-      {failed && snapshot && (
+      {true && (
         <>
           <p role="alert">
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p role="alert"></p>, …(3) ] to have a length of 3 but got 4

[Killed] ConditionalExpression
src/appearance.tsx:37:8
           </p>
         </>
       )}
-      {snapshot && <AppearanceForm snapshot={snapshot} heading={heading} />}
+      {false}
     </main>
   );
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] ConditionalExpression
src/appearance.tsx:37:8
           </p>
         </>
       )}
-      {snapshot && <AppearanceForm snapshot={snapshot} heading={heading} />}
+      {true}
     </main>
   );
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] BooleanLiteral
src/appearance.tsx:49:26
   heading: RefObject<HTMLHeadingElement | null>;
 }) {
   const { save, reload, reading, uncertain } = useAppearance();
-  const sending = useRef(false);
+  const sending = useRef(true);
   const [saving, setSaving] = useState(false);
   const [saved, setSaved] = useState(false);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BooleanLiteral
src/appearance.tsx:50:40
 }) {
   const { save, reload, reading, uncertain } = useAppearance();
   const sending = useRef(false);
-  const [saving, setSaving] = useState(false);
+  const [saving, setSaving] = useState(true);
   const [saved, setSaved] = useState(false);
   const recoveryInitiator = useRef<HTMLElement | null>(null);
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: Unable to find an element with the text: Al salir de esta pantalla se descartan los cambios sin guardar.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Survived] BooleanLiteral
src/appearance.tsx:51:38
   const { save, reload, reading, uncertain } = useAppearance();
   const sending = useRef(false);
   const [saving, setSaving] = useState(false);
-  const [saved, setSaved] = useState(false);
+  const [saved, setSaved] = useState(true);
   const recoveryInitiator = useRef<HTMLElement | null>(null);
   useEffect(() => {

[Killed] BlockStatement
src/appearance.tsx:53:19
   const [saving, setSaving] = useState(false);
   const [saved, setSaved] = useState(false);
   const recoveryInitiator = useRef<HTMLElement | null>(null);
-  useEffect(() => {
-    const moved = (event: FocusEvent) => {
-      if (event.target !== recoveryInitiator.current)
-        recoveryInitiator.current = null;
-    };
-    document.addEventListener("focusin", moved);
-    return () => document.removeEventListener("focusin", moved);
-  }, []);
+  useEffect(() => {}, []);
   useLayoutEffect(() => {
     const control = recoveryInitiator.current;
killedBy: @s33 does not reclaim focus after a deliberate move followed by blur during recovery
statusReason: expected <h1 tabindex="-1"></h1> to be <body><div>…(1)</div></body> // Object.is equality

[Killed] CallExpression
src/appearance.tsx:53:3
   const [saving, setSaving] = useState(false);
   const [saved, setSaved] = useState(false);
   const recoveryInitiator = useRef<HTMLElement | null>(null);
-  useEffect(() => {
-    const moved = (event: FocusEvent) => {
-      if (event.target !== recoveryInitiator.current)
-        recoveryInitiator.current = null;
-    };
-    document.addEventListener("focusin", moved);
-    return () => document.removeEventListener("focusin", moved);
-  }, []);
+  ;
   useLayoutEffect(() => {
     const control = recoveryInitiator.current;
killedBy: @s33 does not reclaim focus after a deliberate move followed by blur during recovery
statusReason: expected <h1 tabindex="-1"></h1> to be <body><div>…(1)</div></body> // Object.is equality

[Killed] BlockStatement
src/appearance.tsx:54:42
   const [saved, setSaved] = useState(false);
   const recoveryInitiator = useRef<HTMLElement | null>(null);
   useEffect(() => {
-    const moved = (event: FocusEvent) => {
-      if (event.target !== recoveryInitiator.current)
-        recoveryInitiator.current = null;
-    };
+    const moved = (event: FocusEvent) => {};
     document.addEventListener("focusin", moved);
     return () => document.removeEventListener("focusin", moved);
killedBy: @s33 does not reclaim focus after a deliberate move followed by blur during recovery
statusReason: expected <h1 tabindex="-1"></h1> to be <body><div>…(1)</div></body> // Object.is equality

[Killed] ConditionalExpression
src/appearance.tsx:55:11
   const recoveryInitiator = useRef<HTMLElement | null>(null);
   useEffect(() => {
     const moved = (event: FocusEvent) => {
-      if (event.target !== recoveryInitiator.current)
+      if (false)
         recoveryInitiator.current = null;
     };
killedBy: @s33 does not reclaim focus after a deliberate move followed by blur during recovery
statusReason: expected <h1 tabindex="-1"></h1> to be <body><div>…(1)</div></body> // Object.is equality

[Killed] EqualityOperator
src/appearance.tsx:55:11
   const recoveryInitiator = useRef<HTMLElement | null>(null);
   useEffect(() => {
     const moved = (event: FocusEvent) => {
-      if (event.target !== recoveryInitiator.current)
+      if (event.target === recoveryInitiator.current)
         recoveryInitiator.current = null;
     };
killedBy: @s33 does not reclaim focus after a deliberate move followed by blur during recovery
statusReason: expected <h1 tabindex="-1"></h1> to be <body><div>…(1)</div></body> // Object.is equality

[Killed] StringLiteral
src/appearance.tsx:58:31
       if (event.target !== recoveryInitiator.current)
         recoveryInitiator.current = null;
     };
-    document.addEventListener("focusin", moved);
+    document.addEventListener("", moved);
     return () => document.removeEventListener("focusin", moved);
   }, []);
killedBy: @s33 does not reclaim focus after a deliberate move followed by blur during recovery
statusReason: expected <h1 tabindex="-1"></h1> to be <body><div>…(1)</div></body> // Object.is equality

[Survived] ArrowFunction
src/appearance.tsx:59:12
         recoveryInitiator.current = null;
     };
     document.addEventListener("focusin", moved);
-    return () => document.removeEventListener("focusin", moved);
+    return () => undefined;
   }, []);
   useLayoutEffect(() => {

[Killed] BlockStatement
src/appearance.tsx:61:25
     document.addEventListener("focusin", moved);
     return () => document.removeEventListener("focusin", moved);
   }, []);
-  useLayoutEffect(() => {
-    const control = recoveryInitiator.current;
-    if (!uncertain && control) {
-      recoveryInitiator.current = null;
-      if (!control.isConnected && document.activeElement === document.body)
-        heading.current?.focus();
-    }
-  }, [uncertain, heading]);
+  useLayoutEffect(() => {}, [uncertain, heading]);
   const [fieldErrors, setFieldErrors] = useState<
     Partial<Record<keyof AppearanceInput, string>>
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Apariencia
</h1>

[Killed] BlockStatement
src/appearance.tsx:63:32
   }, []);
   useLayoutEffect(() => {
     const control = recoveryInitiator.current;
-    if (!uncertain && control) {
-      recoveryInitiator.current = null;
-      if (!control.isConnected && document.activeElement === document.body)
-        heading.current?.focus();
-    }
+    if (!uncertain && control) {}
   }, [uncertain, heading]);
   const [fieldErrors, setFieldErrors] = useState<
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Apariencia
</h1>

[Killed] ConditionalExpression
src/appearance.tsx:63:9
   }, []);
   useLayoutEffect(() => {
     const control = recoveryInitiator.current;
-    if (!uncertain && control) {
+    if (false) {
       recoveryInitiator.current = null;
       if (!control.isConnected && document.activeElement === document.body)
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Apariencia
</h1>

[Killed] EqualityOperator
src/appearance.tsx:65:35
     const control = recoveryInitiator.current;
     if (!uncertain && control) {
       recoveryInitiator.current = null;
-      if (!control.isConnected && document.activeElement === document.body)
+      if (!control.isConnected && document.activeElement !== document.body)
         heading.current?.focus();
     }
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Apariencia
</h1>

[Killed] BooleanLiteral
src/appearance.tsx:65:11
     const control = recoveryInitiator.current;
     if (!uncertain && control) {
       recoveryInitiator.current = null;
-      if (!control.isConnected && document.activeElement === document.body)
+      if (control.isConnected && document.activeElement === document.body)
         heading.current?.focus();
     }
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: expect(element).toHaveFocus()

Expected element with focus:
  <h1
  tabindex="-1"
>
  Apariencia
</h1>

[Survived] OptionalChaining
src/appearance.tsx:66:9
     if (!uncertain && control) {
       recoveryInitiator.current = null;
       if (!control.isConnected && document.activeElement === document.body)
-        heading.current?.focus();
+        heading.current.focus();
     }
   }, [uncertain, heading]);

[Killed] BlockStatement
src/appearance.tsx:77:48
     accentLight: snapshot.accentLight,
     accentDark: snapshot.accentDark,
   });
-  const editDraft = (next: AppearanceInput) => {
-    setDraft(next);
-    setSaved(false);
-  };
+  const editDraft = (next: AppearanceInput) => {};
   const lightValid = isAppearanceAccent(draft.accentLight, "LIGHT");
   const darkValid = isAppearanceAccent(draft.accentDark, "DARK");
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Killed] CallExpression
src/appearance.tsx:78:5
     accentDark: snapshot.accentDark,
   });
   const editDraft = (next: AppearanceInput) => {
-    setDraft(next);
+    ;
     setSaved(false);
   };
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Killed] BooleanLiteral
src/appearance.tsx:79:14
   });
   const editDraft = (next: AppearanceInput) => {
     setDraft(next);
-    setSaved(false);
+    setSaved(true);
   };
   const lightValid = isAppearanceAccent(draft.accentLight, "LIGHT");
killedBy: @s28 @s29 recovers an uncertain PUT by reading saved values before another manual decision: 503
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  role="status"
>
  Apariencia guardada.
</p> instead

[Killed] BlockStatement
src/appearance.tsx:83:77
   };
   const lightValid = isAppearanceAccent(draft.accentLight, "LIGHT");
   const darkValid = isAppearanceAccent(draft.accentDark, "DARK");
-  const editColor = (field: "accentLight" | "accentDark", value: string) => {
-    editDraft({ ...draft, [field]: value });
-    setFieldErrors({ ...fieldErrors, [field]: undefined });
-    if (isAppearanceAccent(value, field === "accentLight" ? "LIGHT" : "DARK"))
-      setPreview({ ...preview, [field]: value.toUpperCase() });
-  };
+  const editColor = (field: "accentLight" | "accentDark", value: string) => {};
   const changed =
     draft.theme !== snapshot.theme ||
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] ObjectLiteral
src/appearance.tsx:84:15
   const lightValid = isAppearanceAccent(draft.accentLight, "LIGHT");
   const darkValid = isAppearanceAccent(draft.accentDark, "DARK");
   const editColor = (field: "accentLight" | "accentDark", value: string) => {
-    editDraft({ ...draft, [field]: value });
+    editDraft({});
     setFieldErrors({ ...fieldErrors, [field]: undefined });
     if (isAppearanceAccent(value, field === "accentLight" ? "LIGHT" : "DARK"))
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: Cannot read properties of undefined (reading 'toUpperCase')

[Killed] ConditionalExpression
src/appearance.tsx:86:35
   const editColor = (field: "accentLight" | "accentDark", value: string) => {
     editDraft({ ...draft, [field]: value });
     setFieldErrors({ ...fieldErrors, [field]: undefined });
-    if (isAppearanceAccent(value, field === "accentLight" ? "LIGHT" : "DARK"))
+    if (isAppearanceAccent(value, false ? "LIGHT" : "DARK"))
       setPreview({ ...preview, [field]: value.toUpperCase() });
   };
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- --accent: #244C3C;
+ --accent: #FFFFFF;

[Killed] ConditionalExpression
src/appearance.tsx:86:9
   const editColor = (field: "accentLight" | "accentDark", value: string) => {
     editDraft({ ...draft, [field]: value });
     setFieldErrors({ ...fieldErrors, [field]: undefined });
-    if (isAppearanceAccent(value, field === "accentLight" ? "LIGHT" : "DARK"))
+    if (false)
       setPreview({ ...preview, [field]: value.toUpperCase() });
   };
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- --accent: #FFFFFF;
+ --accent: #00FFFF;

[Killed] MethodExpression
src/appearance.tsx:87:41
     editDraft({ ...draft, [field]: value });
     setFieldErrors({ ...fieldErrors, [field]: undefined });
     if (isAppearanceAccent(value, field === "accentLight" ? "LIGHT" : "DARK"))
-      setPreview({ ...preview, [field]: value.toUpperCase() });
+      setPreview({ ...preview, [field]: value.toLowerCase() });
   };
   const changed =
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- --accent: #FFFFFF;
+ --accent: #ffffff;

[Killed] ConditionalExpression
src/appearance.tsx:90:5
       setPreview({ ...preview, [field]: value.toUpperCase() });
   };
   const changed =
-    draft.theme !== snapshot.theme ||
-    draft.accentLight !== snapshot.accentLight ||
-    draft.accentDark !== snapshot.accentDark;
+    true;
   return (
     <form
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Tienes cambios sin guardar.
</p> instead

[Killed] LogicalOperator
src/appearance.tsx:90:5
       setPreview({ ...preview, [field]: value.toUpperCase() });
   };
   const changed =
-    draft.theme !== snapshot.theme ||
-    draft.accentLight !== snapshot.accentLight ||
+    draft.theme !== snapshot.theme && draft.accentLight !== snapshot.accentLight ||
     draft.accentDark !== snapshot.accentDark;
   return (
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: Unable to find an element with the text: Al salir de esta pantalla se descartan los cambios sin guardar.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] EqualityOperator
src/appearance.tsx:91:5
   };
   const changed =
     draft.theme !== snapshot.theme ||
-    draft.accentLight !== snapshot.accentLight ||
+    draft.accentLight === snapshot.accentLight ||
     draft.accentDark !== snapshot.accentDark;
   return (
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Tienes cambios sin guardar.
</p> instead

[Survived] ConditionalExpression
src/appearance.tsx:91:5
   };
   const changed =
     draft.theme !== snapshot.theme ||
-    draft.accentLight !== snapshot.accentLight ||
+    false ||
     draft.accentDark !== snapshot.accentDark;
   return (

[Killed] EqualityOperator
src/appearance.tsx:92:5
   const changed =
     draft.theme !== snapshot.theme ||
     draft.accentLight !== snapshot.accentLight ||
-    draft.accentDark !== snapshot.accentDark;
+    draft.accentDark === snapshot.accentDark;
   return (
     <form
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Tienes cambios sin guardar.
</p> instead

[Survived] ConditionalExpression
src/appearance.tsx:92:5
   const changed =
     draft.theme !== snapshot.theme ||
     draft.accentLight !== snapshot.accentLight ||
-    draft.accentDark !== snapshot.accentDark;
+    false;
   return (
     <form

[Killed] BlockStatement
src/appearance.tsx:96:34
   return (
     <form
       aria-busy={saving}
-      onSubmit={async (event) => {
-        event.preventDefault();
-        if (sending.current || uncertain || !lightValid || !darkValid) return;
-        sending.current = true;
-        setSaving(true);
-        setSaved(false);
-        try {
-          const next = await save(draft);
-          editDraft(next);
-          setFieldErrors({});
-          setPreview({
-            accentLight: next.accentLight,
-            accentDark: next.accentDark,
-          });
-          setSaved(true);
-        } catch (error) {
-          if (error instanceof AppearanceValidationError)
-            setFieldErrors(error.fields);
-        } finally {
-          sending.current = false;
-          setSaving(false);
-        }
-      }}
+      onSubmit={async (event) => {}}
     >
       <fieldset
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Survived] CallExpression
src/appearance.tsx:97:9
     <form
       aria-busy={saving}
       onSubmit={async (event) => {
-        event.preventDefault();
+        ;
         if (sending.current || uncertain || !lightValid || !darkValid) return;
         sending.current = true;

[Killed] LogicalOperator
src/appearance.tsx:98:13
       aria-busy={saving}
       onSubmit={async (event) => {
         event.preventDefault();
-        if (sending.current || uncertain || !lightValid || !darkValid) return;
+        if (sending.current && uncertain || !lightValid || !darkValid) return;
         sending.current = true;
         setSaving(true);
killedBy: @s23 saves one explicit draft and applies it only after confirmation
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] ConditionalExpression
src/appearance.tsx:98:13
       aria-busy={saving}
       onSubmit={async (event) => {
         event.preventDefault();
-        if (sending.current || uncertain || !lightValid || !darkValid) return;
+        if (false) return;
         sending.current = true;
         setSaving(true);
killedBy: @s23 saves one explicit draft and applies it only after confirmation
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] BooleanLiteral
src/appearance.tsx:99:27
       onSubmit={async (event) => {
         event.preventDefault();
         if (sending.current || uncertain || !lightValid || !darkValid) return;
-        sending.current = true;
+        sending.current = false;
         setSaving(true);
         setSaved(false);
killedBy: @s23 saves one explicit draft and applies it only after confirmation
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] BooleanLiteral
src/appearance.tsx:100:19
         event.preventDefault();
         if (sending.current || uncertain || !lightValid || !darkValid) return;
         sending.current = true;
-        setSaving(true);
+        setSaving(false);
         setSaved(false);
         try {
killedBy: @s23 saves one explicit draft and applies it only after confirmation
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] BooleanLiteral
src/appearance.tsx:101:18
         if (sending.current || uncertain || !lightValid || !darkValid) return;
         sending.current = true;
         setSaving(true);
-        setSaved(false);
+        setSaved(true);
         try {
           const next = await save(draft);
killedBy: @s29 retains uncertainty after failed recovery and announces the next pending consultation: 503
statusReason: Found multiple elements with the role "status"

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  role="status"
>

[Killed] BlockStatement
src/appearance.tsx:102:13
         sending.current = true;
         setSaving(true);
         setSaved(false);
-        try {
-          const next = await save(draft);
-          editDraft(next);
-          setFieldErrors({});
-          setPreview({
-            accentLight: next.accentLight,
-            accentDark: next.accentDark,
-          });
-          setSaved(true);
-        } catch (error) {
+        try {} catch (error) {
           if (error instanceof AppearanceValidationError)
             setFieldErrors(error.fields);
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Survived] CallExpression
src/appearance.tsx:104:11
         setSaved(false);
         try {
           const next = await save(draft);
-          editDraft(next);
+          ;
           setFieldErrors({});
           setPreview({

[Killed] CallExpression
src/appearance.tsx:105:11
         try {
           const next = await save(draft);
           editDraft(next);
-          setFieldErrors({});
+          ;
           setPreview({
             accentLight: next.accentLight,
killedBy: @s37 Guardar apariencia clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p>, …(1) ] to have a length of +0 but got 3

[Killed] BooleanLiteral
src/appearance.tsx:110:20
             accentLight: next.accentLight,
             accentDark: next.accentDark,
           });
-          setSaved(true);
+          setSaved(false);
         } catch (error) {
           if (error instanceof AppearanceValidationError)
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >
