[Killed] BlockStatement
src/appearance.tsx:111:25
             accentDark: next.accentDark,
           });
           setSaved(true);
-        } catch (error) {
-          if (error instanceof AppearanceValidationError)
-            setFieldErrors(error.fields);
-        } finally {
+        } catch (error) {} finally {
           sending.current = false;
           setSaving(false);
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] ConditionalExpression
src/appearance.tsx:112:15
           });
           setSaved(true);
         } catch (error) {
-          if (error instanceof AppearanceValidationError)
+          if (false)
             setFieldErrors(error.fields);
         } finally {
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] ConditionalExpression
src/appearance.tsx:112:15
           });
           setSaved(true);
         } catch (error) {
-          if (error instanceof AppearanceValidationError)
+          if (true)
             setFieldErrors(error.fields);
         } finally {
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: /No podemos confirmar el guardado/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] CallExpression
src/appearance.tsx:113:13
           setSaved(true);
         } catch (error) {
           if (error instanceof AppearanceValidationError)
-            setFieldErrors(error.fields);
+            ;
         } finally {
           sending.current = false;
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: Unable to find role="alert"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] BlockStatement
src/appearance.tsx:114:19
         } catch (error) {
           if (error instanceof AppearanceValidationError)
             setFieldErrors(error.fields);
-        } finally {
-          sending.current = false;
-          setSaving(false);
-        }
+        } finally {}
       }}
     >
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] BooleanLiteral
src/appearance.tsx:115:29
           if (error instanceof AppearanceValidationError)
             setFieldErrors(error.fields);
         } finally {
-          sending.current = false;
+          sending.current = true;
           setSaving(false);
         }
killedBy: @s37 Guardar apariencia clears obsolete server errors together with the replaced draft
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] BooleanLiteral
src/appearance.tsx:116:21
             setFieldErrors(error.fields);
         } finally {
           sending.current = false;
-          setSaving(false);
+          setSaving(true);
         }
       }}
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ArrowFunction
src/appearance.tsx:134:15
             ["DARK", "Oscuro"],
             ["SYSTEM", "Sistema"],
           ] as const
-        ).map(([value, label]) => (
-          <label key={value}>
-            <input
-              type="radio"
-              name="theme"
-              value={value}
-              checked={draft.theme === value}
-              onChange={() => {
-                editDraft({ ...draft, theme: value });
-                setFieldErrors({ ...fieldErrors, theme: undefined });
-              }}
-            />
-            {label}
-          </label>
-        ))}
+        ).map(() => undefined)}
       </fieldset>
       {fieldErrors.theme && (
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: Unable to find role="radio" and name "Oscuro"

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] ConditionalExpression
src/appearance.tsx:140:24
               type="radio"
               name="theme"
               value={value}
-              checked={draft.theme === value}
+              checked={false}
               onChange={() => {
                 editDraft({ ...draft, theme: value });
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Killed] EqualityOperator
src/appearance.tsx:140:24
               type="radio"
               name="theme"
               value={value}
-              checked={draft.theme === value}
+              checked={draft.theme !== value}
               onChange={() => {
                 editDraft({ ...draft, theme: value });
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  checked=""
  name="theme"
  type="radio"
  value="LIGHT"

[Killed] BlockStatement
src/appearance.tsx:141:31
               name="theme"
               value={value}
               checked={draft.theme === value}
-              onChange={() => {
-                editDraft({ ...draft, theme: value });
-                setFieldErrors({ ...fieldErrors, theme: undefined });
-              }}
+              onChange={() => {}}
             />
             {label}
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: Unable to find an element with the text: Al salir de esta pantalla se descartan los cambios sin guardar.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] LogicalOperator
src/appearance.tsx:150:8
           </label>
         ))}
       </fieldset>
-      {fieldErrors.theme && (
-        <p id="appearance-theme-error" role="alert">
-          {fieldErrors.theme}
-        </p>
-      )}
+      {fieldErrors.theme || <p id="appearance-theme-error" role="alert">
+          {fieldErrors.theme}
+        </p>}
       <label htmlFor="appearance-light">Color de acento claro</label>
       <label>
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p> ] to have a length of 3 but got 2

[Killed] ConditionalExpression
src/appearance.tsx:150:8
           </label>
         ))}
       </fieldset>
-      {fieldErrors.theme && (
-        <p id="appearance-theme-error" role="alert">
-          {fieldErrors.theme}
-        </p>
-      )}
+      {false}
       <label htmlFor="appearance-light">Color de acento claro</label>
       <label>
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p> ] to have a length of 3 but got 2

[Survived] MethodExpression
src/appearance.tsx:161:18
         <input
           type="color"
           disabled={saving}
-          value={(/^#[0-9a-f]{6}$/i.test(draft.accentLight)
-            ? draft.accentLight
-            : preview.accentLight
-          ).toLowerCase()}
+          value={(/^#[0-9a-f]{6}$/i.test(draft.accentLight) ? draft.accentLight : preview.accentLight).toUpperCase()}
           onChange={(event) => editColor("accentLight", event.target.value)}
         />

[Killed] Regex
src/appearance.tsx:161:19
         <input
           type="color"
           disabled={saving}
-          value={(/^#[0-9a-f]{6}$/i.test(draft.accentLight)
+          value={(/^#[0-9a-f]$/i.test(draft.accentLight)
             ? draft.accentLight
             : preview.accentLight
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveValue(#ffffff)

Expected the element to have value:
  #ffffff
Received:
  #244c3c

[Killed] ArrowFunction
src/appearance.tsx:165:21
             ? draft.accentLight
             : preview.accentLight
           ).toLowerCase()}
-          onChange={(event) => editColor("accentLight", event.target.value)}
+          onChange={() => undefined}
         />
       </label>
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveValue(#244c3c)

Expected the element to have value:
  #244c3c
Received:
  #0000FF

[Killed] ArrowFunction
src/appearance.tsx:173:19
         name="accentLight"
         readOnly={saving}
         value={draft.accentLight}
-        onChange={(event) => editColor("accentLight", event.target.value)}
+        onChange={() => undefined}
         aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
         aria-describedby={
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] StringLiteral
src/appearance.tsx:173:40
         name="accentLight"
         readOnly={saving}
         value={draft.accentLight}
-        onChange={(event) => editColor("accentLight", event.target.value)}
+        onChange={(event) => editColor("", event.target.value)}
         aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
         aria-describedby={
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] LogicalOperator
src/appearance.tsx:174:23
         readOnly={saving}
         value={draft.accentLight}
         onChange={(event) => editColor("accentLight", event.target.value)}
-        aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
+        aria-invalid={!lightValid && Boolean(fieldErrors.accentLight)}
         aria-describedby={
           !lightValid || fieldErrors.accentLight
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAttribute("aria-invalid", "true") // element.getAttribute("aria-invalid") === "true"

Expected the element to have attribute:
  aria-invalid="true"
Received:
  aria-invalid="false"

[Killed] ConditionalExpression
src/appearance.tsx:174:23
         readOnly={saving}
         value={draft.accentLight}
         onChange={(event) => editColor("accentLight", event.target.value)}
-        aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
+        aria-invalid={false}
         aria-describedby={
           !lightValid || fieldErrors.accentLight
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAttribute("aria-invalid", "true") // element.getAttribute("aria-invalid") === "true"

Expected the element to have attribute:
  aria-invalid="true"
Received:
  aria-invalid="false"

[Killed] BooleanLiteral
src/appearance.tsx:176:11
         onChange={(event) => editColor("accentLight", event.target.value)}
         aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
         aria-describedby={
-          !lightValid || fieldErrors.accentLight
+          lightValid || fieldErrors.accentLight
             ? "appearance-light-error"
             : undefined
killedBy: @s27 retains an invalid color with an accessible error and the last safe preview
statusReason: expect(element).toHaveAccessibleDescription()

Expected element to have accessible description:
  Elige un color con más contraste. La muestra conserva el último color válido.
Received:

[Killed] ConditionalExpression
src/appearance.tsx:176:11
         onChange={(event) => editColor("accentLight", event.target.value)}
         aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
         aria-describedby={
-          !lightValid || fieldErrors.accentLight
+          false
             ? "appearance-light-error"
             : undefined
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAccessibleDescription()

Expected element to have accessible description:
  Elige otro color claro.
Received:

[Killed] StringLiteral
src/appearance.tsx:177:15
         aria-invalid={!lightValid || Boolean(fieldErrors.accentLight)}
         aria-describedby={
           !lightValid || fieldErrors.accentLight
-            ? "appearance-light-error"
+            ? ""
             : undefined
         }
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveAccessibleDescription()

Expected element to have accessible description:
  Elige otro color claro.
Received:

[Killed] LogicalOperator
src/appearance.tsx:181:8
             : undefined
         }
       />
-      {(!lightValid || fieldErrors.accentLight) && (
-        <p id="appearance-light-error" role="alert">
-          {fieldErrors.accentLight ??
-            "Elige un color con más contraste. La muestra conserva el último color válido."}
-        </p>
-      )}
+      {!lightValid || fieldErrors.accentLight || <p id="appearance-light-error" role="alert">
+          {fieldErrors.accentLight ?? "Elige un color con más contraste. La muestra conserva el último color válido."}
+        </p>}
       <label htmlFor="appearance-dark">Color de acento oscuro</label>
       <label>
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p> ] to have a length of 3 but got 2

[Killed] BooleanLiteral
src/appearance.tsx:181:9
             : undefined
         }
       />
-      {(!lightValid || fieldErrors.accentLight) && (
+      {(lightValid || fieldErrors.accentLight) && (
         <p id="appearance-light-error" role="alert">
           {fieldErrors.accentLight ??
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p> ] to have a length of +0 but got 1

[Killed] LogicalOperator
src/appearance.tsx:183:12
       />
       {(!lightValid || fieldErrors.accentLight) && (
         <p id="appearance-light-error" role="alert">
-          {fieldErrors.accentLight ??
-            "Elige un color con más contraste. La muestra conserva el último color válido."}
+          {fieldErrors.accentLight && "Elige un color con más contraste. La muestra conserva el último color válido."}
         </p>
       )}
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentLight'
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Elige otro color claro.
Received:
  Elige un color con más contraste. La muestra conserva el último color válido.

[Survived] MethodExpression
src/appearance.tsx:193:18
         <input
           type="color"
           disabled={saving}
-          value={(/^#[0-9a-f]{6}$/i.test(draft.accentDark)
-            ? draft.accentDark
-            : preview.accentDark
-          ).toLowerCase()}
+          value={(/^#[0-9a-f]{6}$/i.test(draft.accentDark) ? draft.accentDark : preview.accentDark).toUpperCase()}
           onChange={(event) => editColor("accentDark", event.target.value)}
         />

[Killed] Regex
src/appearance.tsx:193:19
         <input
           type="color"
           disabled={saving}
-          value={(/^#[0-9a-f]{6}$/i.test(draft.accentDark)
+          value={(/^#[0-9a-f]$/i.test(draft.accentDark)
             ? draft.accentDark
             : preview.accentDark
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveValue(#000000)

Expected the element to have value:
  #000000
Received:
  #ffffff

[Killed] ArrowFunction
src/appearance.tsx:197:21
             ? draft.accentDark
             : preview.accentDark
           ).toLowerCase()}
-          onChange={(event) => editColor("accentDark", event.target.value)}
+          onChange={() => undefined}
         />
       </label>
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- --accent: #FFFFFF;
+ --accent: #B7E4C7;

[Killed] ArrowFunction
src/appearance.tsx:205:19
         name="accentDark"
         readOnly={saving}
         value={draft.accentDark}
-        onChange={(event) => editColor("accentDark", event.target.value)}
+        onChange={() => undefined}
         aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
         aria-describedby={
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentDark'
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] StringLiteral
src/appearance.tsx:205:40
         name="accentDark"
         readOnly={saving}
         value={draft.accentDark}
-        onChange={(event) => editColor("accentDark", event.target.value)}
+        onChange={(event) => editColor("", event.target.value)}
         aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
         aria-describedby={
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentDark'
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] BooleanLiteral
src/appearance.tsx:206:23
         readOnly={saving}
         value={draft.accentDark}
         onChange={(event) => editColor("accentDark", event.target.value)}
-        aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
+        aria-invalid={darkValid || Boolean(fieldErrors.accentDark)}
         aria-describedby={
           !darkValid || fieldErrors.accentDark
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expect(element).toHaveAttribute("aria-invalid", "false") // element.getAttribute("aria-invalid") === "false"

Expected the element to have attribute:
  aria-invalid="false"
Received:
  aria-invalid="true"

[Killed] LogicalOperator
src/appearance.tsx:206:23
         readOnly={saving}
         value={draft.accentDark}
         onChange={(event) => editColor("accentDark", event.target.value)}
-        aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
+        aria-invalid={!darkValid && Boolean(fieldErrors.accentDark)}
         aria-describedby={
           !darkValid || fieldErrors.accentDark
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentDark'
statusReason: expect(element).toHaveAttribute("aria-invalid", "true") // element.getAttribute("aria-invalid") === "true"

Expected the element to have attribute:
  aria-invalid="true"
Received:
  aria-invalid="false"

[Killed] BooleanLiteral
src/appearance.tsx:208:11
         onChange={(event) => editColor("accentDark", event.target.value)}
         aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
         aria-describedby={
-          !darkValid || fieldErrors.accentDark
+          darkValid || fieldErrors.accentDark
             ? "appearance-dark-error"
             : undefined
killedBy: @s21 synchronizes native color selectors with hexadecimal drafts
statusReason: expect(element).toHaveAccessibleDescription()

Expected element to have accessible description:
  Elige un color con más contraste. La muestra conserva el último color válido.
Received:

[Killed] ConditionalExpression
src/appearance.tsx:208:11
         onChange={(event) => editColor("accentDark", event.target.value)}
         aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
         aria-describedby={
-          !darkValid || fieldErrors.accentDark
+          false
             ? "appearance-dark-error"
             : undefined
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentDark'
statusReason: expect(element).toHaveAccessibleDescription()

Expected element to have accessible description:
  Elige otro color oscuro.
Received:

[Killed] StringLiteral
src/appearance.tsx:209:15
         aria-invalid={!darkValid || Boolean(fieldErrors.accentDark)}
         aria-describedby={
           !darkValid || fieldErrors.accentDark
-            ? "appearance-dark-error"
+            ? ""
             : undefined
         }
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentDark'
statusReason: expect(element).toHaveAccessibleDescription()

Expected element to have accessible description:
  Elige otro color oscuro.
Received:

[Killed] ConditionalExpression
src/appearance.tsx:213:8
             : undefined
         }
       />
-      {(!darkValid || fieldErrors.accentDark) && (
-        <p id="appearance-dark-error" role="alert">
-          {fieldErrors.accentDark ??
-            "Elige un color con más contraste. La muestra conserva el último color válido."}
-        </p>
-      )}
+      {false}
       {changed && <p>Tienes cambios sin guardar.</p>}
       {changed && (
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p> ] to have a length of 3 but got 2

[Killed] ConditionalExpression
src/appearance.tsx:213:9
             : undefined
         }
       />
-      {(!darkValid || fieldErrors.accentDark) && (
+      {(true) && (
         <p id="appearance-dark-error" role="alert">
           {fieldErrors.accentDark ??
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p> ] to have a length of +0 but got 1

[Killed] LogicalOperator
src/appearance.tsx:215:12
       />
       {(!darkValid || fieldErrors.accentDark) && (
         <p id="appearance-dark-error" role="alert">
-          {fieldErrors.accentDark ??
-            "Elige un color con más contraste. La muestra conserva el último color válido."}
+          {fieldErrors.accentDark && "Elige un color con más contraste. La muestra conserva el último color válido."}
         </p>
       )}
killedBy: @s27 shows a coherent server field rejection and allows correction without recovery: 'accentDark'
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Elige otro color oscuro.
Received:
  Elige un color con más contraste. La muestra conserva el último color válido.

[Killed] ConditionalExpression
src/appearance.tsx:219:8
             "Elige un color con más contraste. La muestra conserva el último color válido."}
         </p>
       )}
-      {changed && <p>Tienes cambios sin guardar.</p>}
+      {false}
       {changed && (
         <p>Al salir de esta pantalla se descartan los cambios sin guardar.</p>
killedBy: @s22 prepares defaults locally and requires an explicit save
statusReason: Unable to find an element with the text: Tienes cambios sin guardar.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <main
      class="appearance"
      id="proyectos"

[Killed] LogicalOperator
src/appearance.tsx:219:8
             "Elige un color con más contraste. La muestra conserva el último color válido."}
         </p>
       )}
-      {changed && <p>Tienes cambios sin guardar.</p>}
+      {changed || <p>Tienes cambios sin guardar.</p>}
       {changed && (
         <p>Al salir de esta pantalla se descartan los cambios sin guardar.</p>
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Tienes cambios sin guardar.
</p> instead

[Killed] ConditionalExpression
src/appearance.tsx:220:8
         </p>
       )}
       {changed && <p>Tienes cambios sin guardar.</p>}
-      {changed && (
-        <p>Al salir de esta pantalla se descartan los cambios sin guardar.</p>
-      )}
+      {true}
       <button
         type="submit"
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: Unable to find an element with the text: Al salir de esta pantalla se descartan los cambios sin guardar.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance.tsx:220:8
         </p>
       )}
       {changed && <p>Tienes cambios sin guardar.</p>}
-      {changed && (
-        <p>Al salir de esta pantalla se descartan los cambios sin guardar.</p>
-      )}
+      {false}
       <button
         type="submit"
killedBy: @s25 warns about leaving a draft and restores only confirmed values on Back
statusReason: Unable to find an element with the text: Al salir de esta pantalla se descartan los cambios sin guardar.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] LogicalOperator
src/appearance.tsx:225:24
       )}
       <button
         type="submit"
-        aria-disabled={saving || uncertain || !lightValid || !darkValid}
+        aria-disabled={(saving || uncertain || !lightValid) && !darkValid}
       >
         Guardar apariencia
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toHaveAttribute("aria-disabled", "true") // element.getAttribute("aria-disabled") === "true"

Expected the element to have attribute:
  aria-disabled="true"
Received:
  aria-disabled="false"

[Killed] LogicalOperator
src/appearance.tsx:225:24
       )}
       <button
         type="submit"
-        aria-disabled={saving || uncertain || !lightValid || !darkValid}
+        aria-disabled={saving && uncertain || !lightValid || !darkValid}
       >
         Guardar apariencia
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toHaveAttribute("aria-disabled", "true") // element.getAttribute("aria-disabled") === "true"

Expected the element to have attribute:
  aria-disabled="true"
Received:
  aria-disabled="false"

[Killed] BlockStatement
src/appearance.tsx:232:24
       <button
         type="button"
         disabled={saving}
-        onClick={() => {
-          editDraft({
-            theme: "SYSTEM",
-            accentLight: "#244C3C",
-            accentDark: "#B7E4C7",
-          });
-          setPreview({ accentLight: "#244C3C", accentDark: "#B7E4C7" });
-          setFieldErrors({});
-        }}
+        onClick={() => {}}
       >
         Restaurar valores predeterminados
killedBy: @s37 Restaurar valores predeterminados clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p>, …(1) ] to have a length of +0 but got 3
