[Killed] StringLiteral
src/appearance.tsx:234:20
         disabled={saving}
         onClick={() => {
           editDraft({
-            theme: "SYSTEM",
+            theme: "",
             accentLight: "#244C3C",
             accentDark: "#B7E4C7",
killedBy: @s22 prepares defaults locally and requires an explicit save
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="SYSTEM"
/>

[Killed] StringLiteral
src/appearance.tsx:236:25
           editDraft({
             theme: "SYSTEM",
             accentLight: "#244C3C",
-            accentDark: "#B7E4C7",
+            accentDark: "",
           });
           setPreview({ accentLight: "#244C3C", accentDark: "#B7E4C7" });
killedBy: @s37 Restaurar valores predeterminados clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p> ] to have a length of +0 but got 1

[Survived] StringLiteral
src/appearance.tsx:238:60
             accentLight: "#244C3C",
             accentDark: "#B7E4C7",
           });
-          setPreview({ accentLight: "#244C3C", accentDark: "#B7E4C7" });
+          setPreview({ accentLight: "#244C3C", accentDark: "" });
           setFieldErrors({});
         }}

[Killed] CallExpression
src/appearance.tsx:239:11
             accentDark: "#B7E4C7",
           });
           setPreview({ accentLight: "#244C3C", accentDark: "#B7E4C7" });
-          setFieldErrors({});
+          ;
         }}
       >
killedBy: @s37 Restaurar valores predeterminados clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p>, …(1) ] to have a length of +0 but got 3

[Killed] BlockStatement
src/appearance.tsx:247:24
       <button
         type="button"
         disabled={saving}
-        onClick={() => {
-          editDraft(snapshot);
-          setFieldErrors({});
-          setPreview({
-            accentLight: snapshot.accentLight,
-            accentDark: snapshot.accentDark,
-          });
-        }}
+        onClick={() => {}}
       >
         Cancelar cambios
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p>, …(1) ] to have a length of +0 but got 3

[Killed] CallExpression
src/appearance.tsx:248:11
         type="button"
         disabled={saving}
         onClick={() => {
-          editDraft(snapshot);
+          ;
           setFieldErrors({});
           setPreview({
killedBy: @s37 cancels a local draft back to confirmed values without an HTTP request
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  checked=""
  name="theme"
  type="radio"
  value="DARK"

[Killed] CallExpression
src/appearance.tsx:249:11
         disabled={saving}
         onClick={() => {
           editDraft(snapshot);
-          setFieldErrors({});
+          ;
           setPreview({
             accentLight: snapshot.accentLight,
killedBy: @s37 Cancelar cambios clears obsolete server errors together with the replaced draft
statusReason: expected [ <p …(2)></p>, <p …(2)></p>, …(1) ] to have a length of +0 but got 3

[Killed] ObjectLiteral
src/appearance.tsx:250:22
         onClick={() => {
           editDraft(snapshot);
           setFieldErrors({});
-          setPreview({
-            accentLight: snapshot.accentLight,
-            accentDark: snapshot.accentDark,
-          });
+          setPreview({});
         }}
       >
killedBy: @s37 cancels a local draft back to confirmed values without an HTTP request
statusReason: expected '' to be '#0000FF' // Object.is equality

[Killed] LogicalOperator
src/appearance.tsx:261:9
       {saving ? (
         <p role="status">Guardando apariencia…</p>
       ) : (
-        saved && <p role="status">Apariencia guardada.</p>
+        saved || <p role="status">Apariencia guardada.</p>
       )}
       {uncertain && (
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance.tsx:261:9
       {saving ? (
         <p role="status">Guardando apariencia…</p>
       ) : (
-        saved && <p role="status">Apariencia guardada.</p>
+        false
       )}
       {uncertain && (
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: Unable to find an element with the text: Apariencia guardada.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="workspace"
    >

[Killed] ConditionalExpression
src/appearance.tsx:269:12
             No podemos confirmar el guardado. Recargar la versión guardada
             reemplazará este borrador.
           </p>
-          {reading && <p role="status">Consultando versión guardada…</p>}
+          {true}
           <button
             type="button"
killedBy: @s29 retains uncertainty after failed recovery and announces the next pending consultation: 503
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] LogicalOperator
src/appearance.tsx:269:12
             No podemos confirmar el guardado. Recargar la versión guardada
             reemplazará este borrador.
           </p>
-          {reading && <p role="status">Consultando versión guardada…</p>}
+          {reading || <p role="status">Consultando versión guardada…</p>}
           <button
             type="button"
killedBy: @s29 retains uncertainty after failed recovery and announces the next pending consultation: 503
statusReason: Unable to find an accessible element with the role "status"

Here are the accessible roles:

  main:

  Name "":
  <main

[Killed] BlockStatement
src/appearance.tsx:273:39
           <button
             type="button"
             aria-disabled={reading}
-            onClick={async (event) => {
-              if (reading) return;
-              recoveryInitiator.current = event.currentTarget;
-              try {
-                const next = await reload();
-                editDraft(next);
-                setFieldErrors({});
-                setPreview({
-                  accentLight: next.accentLight,
-                  accentDark: next.accentDark,
-                });
-              } catch {
-                /* La consulta conserva el borrador y la incertidumbre. */
-              }
-            }}
+            onClick={async (event) => {}}
           >
             Recargar versión guardada
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Killed] ConditionalExpression
src/appearance.tsx:274:19
             type="button"
             aria-disabled={reading}
             onClick={async (event) => {
-              if (reading) return;
+              if (true) return;
               recoveryInitiator.current = event.currentTarget;
               try {
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Survived] ConditionalExpression
src/appearance.tsx:274:19
             type="button"
             aria-disabled={reading}
             onClick={async (event) => {
-              if (reading) return;
+              if (false) return;
               recoveryInitiator.current = event.currentTarget;
               try {

[Killed] BlockStatement
src/appearance.tsx:276:19
             onClick={async (event) => {
               if (reading) return;
               recoveryInitiator.current = event.currentTarget;
-              try {
-                const next = await reload();
-                editDraft(next);
-                setFieldErrors({});
-                setPreview({
-                  accentLight: next.accentLight,
-                  accentDark: next.accentDark,
-                });
-              } catch {
+              try {} catch {
                 /* La consulta conserva el borrador y la incertidumbre. */
               }
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Killed] CallExpression
src/appearance.tsx:278:17
               recoveryInitiator.current = event.currentTarget;
               try {
                 const next = await reload();
-                editDraft(next);
+                ;
                 setFieldErrors({});
                 setPreview({
killedBy: @s28 keeps the write blocked across navigation until deliberate valid recovery
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  name="theme"
  type="radio"
  value="LIGHT"
/>

[Survived] ObjectLiteral
src/appearance.tsx:280:28
                 const next = await reload();
                 editDraft(next);
                 setFieldErrors({});
-                setPreview({
-                  accentLight: next.accentLight,
-                  accentDark: next.accentDark,
-                });
+                setPreview({});
               } catch {
                 /* La consulta conserva el borrador y la incertidumbre. */

[Killed] ArrowFunction
src/appearance.tsx:301:20
         <h2>Vista previa clara</h2>
         <a
           href="#appearance-preview-light"
-          onClick={(event) => event.preventDefault()}
+          onClick={() => undefined}
         >
           Enlace de ejemplo
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: expected '#appearance-preview-light' to be '' // Object.is equality

[Killed] ArrowFunction
src/appearance.tsx:316:20
         <h2>Vista previa oscura</h2>
         <a
           href="#appearance-preview-dark"
-          onClick={(event) => event.preventDefault()}
+          onClick={() => undefined}
         >
           Enlace de ejemplo
killedBy: @s21 provides separate native link and button samples without invoking application actions
statusReason: expected '#appearance-preview-dark' to be '' // Object.is equality
