[Killed] ConditionalExpression
src/workspace.tsx:79:27
           </RouteLink>
           <RouteLink
             href="/apariencia"
-            aria-current={section === "Apariencia" ? "page" : undefined}
+            aria-current={false ? "page" : undefined}
           >
             Apariencia
killedBy: @s20 opens appearance through the principal navigation at its stable route
statusReason: expect(element).toHaveAttribute("aria-current", "page") // element.getAttribute("aria-current") === "page"

Expected the element to have attribute:
  aria-current="page"
Received:
  null

[Killed] EqualityOperator
src/workspace.tsx:79:27
           </RouteLink>
           <RouteLink
             href="/apariencia"
-            aria-current={section === "Apariencia" ? "page" : undefined}
+            aria-current={section !== "Apariencia" ? "page" : undefined}
           >
             Apariencia
killedBy: @s20 opens appearance through the principal navigation at its stable route
statusReason: expect(element).toHaveAttribute("aria-current", "page") // element.getAttribute("aria-current") === "page"

Expected the element to have attribute:
  aria-current="page"
Received:
  null
